<html>
<head>
<title>Frequently Asked Questions</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Foire aux questions (FAQ)</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	<a name="item0"></a><br \>
<br \>
<b>Questions sur FreeBASIC:</b><br \>
<br \>
<div class="fb_indent"><b>- <a href="#item1">Qu'est-ce que FreeBASIC?</a></b><br \>
<b>- <a href="#item2">Qui est responsable de FreeBASIC?</a></b><br \>
<b>- <a href="#item3">Pourquoi devrais-je utiliser FreeBasic plut&ocirc;t que QBasic?</a></b><br \>
<b>- <a href="#item4">Pourquoi devrais-je utiliser FreeBasic plut&ocirc;t que certains autres nouveaux BASIC?</a></b><br \>
<b>- <a href="#item5">FreeBASIC est-il rapide?</a></b><br \>
<b>- <a href="#item6">FreeBASIC est-il compatible avec QuickBasic?</a></b><br \>
<b>- <a href="#item7">FreeBASIC est-il compatible avec Windows? DOS? Linux?</a></b><br \>
<b>- <a href="#item8">La programmation orient&eacute;e objet est elle support&eacute;e par FreeBASIC?</a></b><br \>
<b>- <a href="#item9">Quels sont les plans futurs avec FB / ToDo list?</a></b><br \>
<b>- <a href="#item10">Puis-je programmer des applications GUI avec FB</a></b><br \>
<b>- <a href="#item11">FB est-il appropri&eacute; pour des applications grosses/complexes?</a></b><br \>
<b>- <a href="#item12">Puis-je utiliser un encodage (jeu de caract&egrave;res) non-latin dans mes applications FreeBASIC?</a></b><br \>
<b>- <a href="#item13">Puis-je utiliser les ports Serial/COM et Hardware/CPU dans FB?</a></b><br \>
<br \>
</div><b>Questions de d&eacute;butants sur FreeBASIC</b><br \>
<div class="fb_indent"><b>- <a href="#item20">O&ugrave; puis-je trouver plus d'informations sur FreeBASIC?</a></b><br \>
<b>- <a href="#item21">Pourquoi le GUI de QB ne s'ouvre-t-il pas quand je lance FreeBASIC?</a></b><br \>
<b>- <a href="#item22">Puis-je avoir une version hors ligne de la documentation?</a></b><br \>
<b>- <a href="#item23">Quelle est l'id&eacute;e derri&egrave;re les dialectes FB?</a></b><br \>
<b>- <a href="#item24">Pourquoi mon programme se plante-t-il quand je d&eacute;finis un tableau plus grand que xx?</a></b><br \>
<br \>
</div><b>FreeBasic avanc&eacute;</b><br \>
<br \>
<div class="fb_indent"><b>- <a href="#item31">Comment puis-je lier &agrave; des biblioth&egrave;ques C?</a></b><br \>
<b>- <a href="#item32">Puis-je utiliser un d&eacute;bogueur?</a></b><br \>
<b>- <a href="#item33">Quel est le but des fichiers AR.EXE, AS.EXE et LD.EXE fournis avec FB?</a></b><br \>
<b>- <a href="#item34">Y a-t-il une limitation l'ampleur de mes fichiers source?</a></b><br \>
<b>- <a href="#item35">Puis-je &eacute;crire un OS avec FreeBasic?</a></b><br \>
<b>- <a href="#item36">Je d&eacute;veloppe un syst&egrave;me d'exploitation, FreeBASIC peut-il &ecirc;tre port&eacute; sur mon OS?</a></b><br \>
<b>- <a href="#item37">FreeBasic permet-il le retour de r&eacute;f&eacute;rences &agrave; partir de fonctions, comme en C++?</a></b><br \>
<br \>
</div><a href="#item999">See also</a><br \>
<br \>
<br \>
<br \>
<br \>
<div style="text-align: center;"><b>Questions sur FreeBASIC</b></div><br \>
<br \>
<a name="item1"></a><b>Qu'est-ce que FreeBASIC?</b><br \>
<div class="fb_indent">FreeBASIC est un compilateur BASIC 32-bit libre et gratuit, pour Windows (32-bit), DOS 32 bits en mode prot&eacute;g&eacute; (ex&eacute;cutables COFF, comme DJGPP), et Linux (x86). Il a commenc&eacute; comme une tentative de cr&eacute;er un code compatible, une alternative libre et gratuite &agrave; Microsoft QuickBASIC, mais cela s'est rapidement transform&eacute; en un puissant outil de d&eacute;veloppement, incluant d&eacute;j&agrave; le support de biblioth&egrave;ques, comme Allegro, SDL, OpenGL et beaucoup d'autres dans son installation par d&eacute;faut.<br \>
<br \>
En plus d'avoir une syntaxe compatible la plupart du temps avec QuickBASIC, FreeBasic introduit plusieurs nouvelles fonctionnalit&eacute;s &agrave; ce langage vieillissant, y compris des pointeurs vers les variables et fonctions et les types de donn&eacute;es non sign&eacute;es.<br \>
<br \>
Le compilateur FreeBasic est "auto-h&eacute;bergement" - &eacute;crit en FreeBasic, les biblioth&egrave;ques sont cependant &eacute;crites en C.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item2"></a><b>Qui est responsable de FreeBASIC?</b><br \>
<div class="fb_indent">Les premi&egrave;res versions de FreeBASIC ont &eacute;t&eacute; d&eacute;velopp&eacute;es exclusivement par V1ctor. Les versions ult&eacute;rieures ont vu les contributions de nombreuses personnes, dont Lillo, qui a d&eacute;velopp&eacute; le portage Linux et la biblioth&egrave;que graphique, et DRV, qui a d&eacute;velopp&eacute; le portage DOS.br \>
<br \>
Voir la page <a href="CompilerCredits.html">FreeBASIC Credits</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item3"></a><b>Pourquoi devrais-je utiliser FreeBasic plut&ocirc;t que QBasic?</b><br \>
<div class="fb_indent">FreeBASIC a des avantages innombrables par rapport &agrave; QBasic, QuickBASIC, PDS et Visual Basic pour DOS. <br \>
</div><ul><li> Il supporte les processeurs 32-bit, alors que QBasic est con&ccedil;u pour les CPU 16-bit.<br \>
<li> Il supporte les OS modernes. Il est dot&eacute; de portages pour Windows, Linux et DOS 32 bits.<br \>
<li> Il supporte les API modernes telles que SDL, DirectX, Win32 et OpenGL.<br \>
<li> Il est distribu&eacute; sous licence GPL, ce qui signifie qu'il est gratuit et l&eacute;gal de l'utiliser librement, contrairement &agrave; la plupart des copies de QuickBASIC et autres BASIC.<br \>
<li> 
La biblioth&egrave;que est distribu&eacute;e sous licence LGPL avec une exception suppl&eacute;mentaire, ce qui signifie que vous pouvez faire ce que vous voulez avec vos programmes compil&eacute;s, y compris les vendre (note: probl&egrave;me possible avec biblioth&egrave;que graphique).<br \>
<li> FreeBASIC est, la plupart du temps, beaucoup plus rapide que QuickBASIC et autres BASIC.<br \>
<li> FreeBASIC supporte de nombreuses fonctionnalit&eacute;s, telles que les pointeurs et l'assemblage en ligne (in line), qui ne sont pas disponibles dans QuickBASIC et autres BASIC.<br \>
<li> QuickBASIC ne supporte que le DOS. Le support de Windows pour l'&eacute;mulation DOS (et donc QuickBASIC) est de plus en plus fine avec chaque nouvelle version. Vista ne prend pas en charge les graphiques ou le texte en plein &eacute;cran pour les applications DOS.<br \>
<br \>
</ul><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item4"></a><b>Pourquoi devrais-je utiliser FreeBasic plut&ocirc;t que certains autres nouveaux BASIC?</b><br \>
<div class="fb_indent">FreeBASIC a de nombreux traits qui le rendent pr&eacute;f&eacute;rable &agrave; la plupart des autres impl&eacute;mentations du langage BASIC:<br \>
</div><ul><li> FreeBASIC adh&egrave;re &eacute;troitement &agrave; la syntaxe BASIC standard, ce qui rend plus facile &agrave; utiliser.<br \>
<li> FreeBASIC est compil&eacute; en programmes r&eacute;els (ex&eacute;cutables), et non du "bytecode".<br \>
<li> FreeBASIC a une importante communaut&eacute; d&eacute;di&eacute;e qui a activement particip&eacute; &agrave; l'&eacute;laboration de FreeBASIC.<br \>
<li> FreeBASIC utilise des m&eacute;thodes standard d'acc&egrave;s aux biblioth&egrave;ques communes du langage C. SDL, par exemple, est standard C SDL, et non pas un nouvel ensemble de commandes intrins&egrave;que<br \>
<li> FreeBASIC a des portages vers Windows, Linux et DOS 32-bit. Il conserve une syntaxe coh&eacute;rente entre les trois portages.<br \>
<br \>
</ul><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item5"></a><b>FreeBASIC est-il rapide?</b><br \>
<div class="fb_indent">La plupart des tests effectu&eacute;s par la communaut&eacute; ont montr&eacute; que FreeBASIC est significativement plus rapide que QuickBasic, plus rapide que la plupart des autres BASIC commerciaux et souvent proche de CCG en termes de vitesse.<br \>
<a href="http://shootout.alioth.debian.org/gp4/benchmark.php?test=all&lang=all">Computer Languages Benchmark Game</a>, une &eacute;quipe de test ind&eacute;pendante, donne FreeBASIC pour Linux une vitesse 1,8 fois plus lent que GNU g++. Les tests portent sur ​​les calculs, la m&eacute;moire et la vitesse du disque dans les programmes de la console, aucune capacit&eacute; graphique n'a &eacute;t&eacute; test&eacute;e. Ce n'est pas un mauvais r&eacute;sultat compte tenu que FreeBASIC n'est pas encore un compilateur optimisant.<br \>
Un domaine o&ugrave; il y a une carence notable est la vitesse dans les modes console 32-bit. Bien que FreeBASIC soit constamment sur un pied d'&eacute;galit&eacute; avec les autres-applications 32 bits en mode console, les op&eacute;rations sur 32 bits en mode console sont nettement plus lentes que les op&eacute;rations en console 16-bit, comme dans QuickBasic. Dans la version DOS, certaines op&eacute;rations d'Entr&eacute;e/Sortie peuvent devenir plus lentes apr&egrave;s le portage depuis un BASIC 16-bit vers FB - l'optimisation du code r&eacute;cup&egrave;re de la vitesse.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item6"></a><b>FreeBASIC est-il compatible avec QuickBasic?</b><br \>
<div class="fb_indent">La biblioth&egrave;que graphique de FreeBASIC &eacute;mule les modes graphiques les plus utilis&eacute;s de QB (modes 7,12,13) et impl&eacute;mente toutes les primitives de dessin propos&eacute;es dans QB. <br \>
La plupart des probl&egrave;mes de compatibilit&eacute; r&eacute;sultent de l'utilisation des techniques bas niveau sp&eacute;cifiques au mat&eacute;riel-8086-DOS dans les aciens programmes de QB. Programmation du port VGA, interruptions DOS, commutation des segments de m&eacute;moire, &eacute;criture dans la m&eacute;moire d'&eacute;cran ou jouer de la musique en utilisant le haut-parleur PC ne sont pas directement pris en charge, m&ecirc;me si cela peut &ecirc;tre support&eacute;/&eacute;mul&eacute; par des biblioth&egrave;ques externes.<br \>
D'autres probl&egrave;mes dans le portage d'anciens programmes QB, comme les noms de variables en conflit avec des mots nouveaux de FB, variables avec le nom d'un mot-cl&eacute; QB plus un suffixe de type, la taille par d&eacute;faut des entiers &eacute;tant de 32 bits dans FB, sont trait&eacute;es en ex&eacute;cutant FreeBASIC avec sur la ligne de commande l'option <tt>-lang qb</tt> .<br \>
<br \>
Voir <a href="LangQB.html">Diff&eacute;rences entre FreeBASIC et QuickBasic</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item7"></a><b>FreeBASIC est-il compatible avec Windows? DOS? Linux? </b><br \>
<div class="fb_indent">FreeBASIC est totalement compatible avec Windows, MS-DOS, Free-DOS et Linux. Lors de la planification pour cr&eacute;er un programme pour les trois plates-formes, cependant, gardez &agrave; l'esprit la disponibilit&eacute; d'API -- le code utilisant OpenGL fonctionne sous Windows et Linux, par exemple, mais pas sous DOS, car OpenGL n'est pas disponible pour MS-DOS.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item8"></a><b>La programmation orient&eacute;e objet est elle support&eacute;e par FreeBASIC?</b><br \>
<div class="fb_indent">Certaines fonctionnalit&eacute;s POO sont &agrave; la disposition des utilisateurs de FB depuis la version 0.17. La fonctionnalit&eacute; POO compl&egrave;te est attendue pour le futur. A l'heure actuelle (version 0.22) il existe des m&eacute;thodes &agrave; l'int&eacute;rieur des types d&eacute;finis par l'utilisateur et la surcharge d'op&eacute;rateur, mais l'h&eacute;ritage et le polymorphisme ne sont pas encore mis en oeuvre. Pour plus d' information voir: <a href="http://www.freebasic.net/wiki/wikka.php?wakka=TutBeginnersGuideToTypesAsObjects">Un guide pour d&eacute;butants sur les Types comme Objets</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item9"></a><b>Quels sont les plans futurs avec FB / ToDo list?</b><br \>
<br \>
<div class="fb_indent">Vous pouvez d&eacute;couvrir ce qui est pr&eacute;vu pour les versions futures en consultant directement <a href="http://fbc.svn.sourceforge.net/svnroot/fbc/trunk/FreeBASIC/src/compiler/TODO.txt?view=markup">le fichier TODO</a> pour le compilateur, qui est actuellement dans le SVN.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item10"></a><b>Puis-je programmer des applications GUI avec FB</b><br \>
<div class="fb_indent">Oui, vous le pouvez. Les fichier en-t&ecirc;tes qui vous permettent d'appeler l'API graphique de Windows ou Linux sont fournies avec les versions respectives, mais les programmes fabriqu&eacute;s de cette fa&ccedil;on ne sont pas portables.<br \>
Il y a quelques protocoles API et applications RAD exp&eacute;rimentales qui cr&eacute;ent du code non portable GUI pour Windows.<br \>
Pour une programmation portable une biblioth&egrave;que GUI telle que GTK ou "wx-Widgets" doit &ecirc;tre utilis&eacute;e. Les fichier en-t&ecirc;tes GTK sont fournis avec FB, mais la fonctionnalit&eacute; POO actuellement disponible en FB emp&ecirc;che l'utilisation de wx-Widgets. Les programmes cr&eacute;&eacute;s avec ces biblioth&egrave;ques peuvent obliger l'utilisateur &agrave; installer les biblioth&egrave;ques encapsulatrices (wrapper) dans leurs syst&egrave;mes.<br \>
Pour les jeux et les petites applications graphiques il y a quelques biblioth&egrave;ques sp&eacute;cifiques-FB qui dessinent et g&eacute;rent des commandes simples comme des boutons et des bo&icirc;tes &agrave; l'int&eacute;rieur de l'&eacute;cran graphique, les programmes r&eacute;alis&eacute;s avec ces biblioth&egrave;ques sont enti&egrave;rement portables<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item11"></a><b>FB est-il appropri&eacute; pour des applications grosses/complexes?</b><br \>
<div class="fb_indent">Le compilateur FB est "auto-h&eacute;bergement", il est lui-m&ecirc;me programm&eacute; dans FB. Cela signifie plus de 120 000 lignes de code pour le moment, une application assez complexe.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item12"></a><b>Puis-je utiliser un encodage (jeu de caract&egrave;res) non-latin dans mes applications FreeBASIC?</b><br \>
<br \>
<div class="fb_indent">FreeBASIC supporte Unicode qui est fourni par la biblioth&egrave;que d'ex&eacute;cution C pour la plate-forme donn&eacute;e. Cela signifie que FB DOS ne sera pas g&ecirc;n&eacute; par Unicode. Sur d'autres plateformes, vous pouvez utiliser <a href="KeyPgWstring.html">Wstrings</a> pour supporter tout jeu de caract&egrave;res dont vous avez besoin. Le mot-cl&eacute; OPEN a un param&egrave;tre additionnel <a href="KeyPgEncoding.html">Encoding</a> permettant diff&eacute;rents encodages. Comme FreeBasic est lui-m&ecirc;me cod&eacute; dans FB, cela signifie que vous pouvez coder votre source dans un &eacute;diteur Unicode donc les commentaires et les cha&icirc;nes litt&eacute;rales peuvent &ecirc;tre dans n'importe quel jeu de caract&egrave;res (mots-cl&eacute;s, &eacute;tiquettes, noms de variables et de proc&eacute;dures doivent &ecirc;tre conserv&eacute;s &agrave; l'int&eacute;rieur du jeu ASCII..).<br \>
Pour la sortie &agrave; l'&eacute;cran le support est diff&eacute;rent de la console aux graphiques. En mode console l'affichage de "wstring" en caract&egrave;res non latins est support&eacute; si la police de caract&egrave;res de la console le permet. Le mode graphique utilise une police avec un jeu de caract&egrave;res interne CP437 (l'ancien jeu de caract&egrave;res du DOS) donc les affichages non latins une police personnalis&eacute;e et l'utilisation du mot-clef <a href="KeyPgDrawString.html">Draw String</a> keyword. Des outils tiers existent pour introduire une police externe et la convertir au format DRAW STRING.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item13"></a><b>Puis-je utiliser les ports Serial/COM et Hardware/CPU dans FB?</b><br \>
<div class="fb_indent"> Oui, FB a des fonctions int&eacute;gr&eacute;es pour acc&eacute;der aux ports serial/COM port et hardware/CPU sans avoir besoin de biblioth&egrave;ques externes. Voir <a href="#item999">FAQ des sp&eacute;cificit&eacute;s des OS</a> pour des d&eacute;tails pour votre OS ainsi que <a href="KeyPgOpenCom.html">Open Com</a>, <a href="KeyPgInp.html">Inp</a> et <a href="KeyPgOut.html">Out</a> .<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<div style="text-align: center;"><b>Questions de d&eacute;butants sur FreeBASIC</b></div><br \>
<br \>
<a name="item20"></a><b>O&ugrave; puis-je trouver plus d'informations sur FreeBASIC?</b><br \>
<div class="fb_indent">Le <a href="http://www.freebasic.net/wiki/">Wiki FreeBASIC</a> est le manuel le-plus-&agrave;-jour pour l'utilisation de FreeBASIC.<br \>
<br \>
Des forums actifs sur FreeBASIC, outre le <a href="http://www.freebasic.net/forum">forum officiel</a>, peuvent &ecirc;tre trouv&eacute;s &agrave; <a href="http://www.qbasicnews.com/">qbasicnews</a>, <a href="http://www.petesqbsite.com/forum/">Pete's QB Site</a> , <a href="http://games.freebasic.net/forum/index.php">the FB Games directory</a>  ou  <a href="http://www.freebasic-portal.de">freebasic-portal.de (en allemand)</a>. <br \>
<br \>
Des magazines actifs qui ont r&eacute;guli&egrave;rement des articles li&eacute;s FreeBasic <a href="http://www.petesqbsite.com/sections/express/express.shtml">QB Express</a> and <a href="http://www.qbxl.net/">QBXL Magazine</a>. Ces magazines sont toujours &agrave; la recherche de nouveaux articles, donc si vous pensez que vous avez une bonne id&eacute;e pour un article sur FreeBasic, soumettez-le!<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item21"></a><b>Pourquoi le GUI de QB ne s'ouvre-t-il pas quand je lance FreeBASIC?</b><br \>
<div class="fb_indent">QB avait un Environnement de D&eacute;veloppement Int&eacute;gr&eacute; ou en anglais: Integrated Development Environment (IDE).  FreeBASIC n'en a pas.<br \>
FreeBASIC est seulement un compilateur, non pas un "clone" complet de QuickBASIC. Il s'agit d'une application en mode console. Il acceptera un fichier BAS sur la ligne de commande et renverra un fichier EXE.<br \>
Vous pouvez cr&eacute;er le fichier BAS avec l'&eacute;diteur simple, plein texte de votre OS (Notepad, EDIT, nano,...), puis lancez le compilateur. <br \>
Si vous ne pouvez vivre sans la coloration syntaxique, le soulignement d'erreur, la gestion de fichiers multiples, un d&eacute;bogueur int&eacute;gr&eacute;, l'aide contextuelle ou d'autres fonctionnalit&eacute;s, vous avez besoin d'un IDE. Voyez <a href="#item999">FAQ des sp&eacute;cificit&eacute;s des OS</a> pour les IDE et &eacute;diteurs disponibles.<br \>
</div> <br \>
<a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item22"></a><b>Puis-je avoir une version hors ligne de la documentation?</b><br \>
<div class="fb_indent">La documentation officielle pour FB est ce Wiki, habituellement la version courante contient les derni&egrave;res am&eacute;liorations du SVN.<br \>
De temps en temps ce Wiki est converti en plusieurs formats lisibles hors-ligne. <a href="http://sourceforge.net/project/showfiles.php?group_id=122342&package_id=159165">CHM</a> pour les utilisateurs de Windows, et <a href="http://www.execulink.com/~coder/freebasic/docs.html">d'autres formats</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item23"></a><b>Quelle est l'id&eacute;e derri&egrave;re les dialectes FB?</b><br \>
<div class="fb_indent">L'id&eacute;e est de permettre des am&eacute;liorations dans le langage tout en conservant une compatibilit&eacute; ascendante avec le code QB. Les bizarreries de la syntaxe QB ne sont pas compatibles avec le style plus rigide requis par la POO. Les nouveaux mots-cl&eacute;s FB sont souvent en conflit avec les noms de variables dans les anciens programmes de QB. QB permettait d'utiliser librement des points dans les noms de variables et n'&eacute;taient pas des proc&eacute;dures d'UDT.<br \>
Les trois dialectes (fb-lang, lang-qb,-lang fblite) permettent de combiner le meilleur de deux mondes. <br \>
</div><ul><li><tt>lang fb</tt> fournit le cadre n&eacute;cessaire pour la programmation orient&eacute;e objet. Les autres dialectes ne donnent pas acc&egrave;s &agrave; la POO.<br \>
<li><tt>lang qb</tt> permettra aux d&eacute;veloppeurs de conserver la compatibilit&eacute; ascendante avec les programmes QB. Les nouveaux mots-cl&eacute;s dans FB peuvent &ecirc;tre utilis&eacute;s par les pr&eacute;c&eacute;dant avec deux caract&egrave;res de soulignement. Par exemple, <tt>Getmouse</tt> peut &ecirc;tre appel&eacute; en utilisant <tt>_</tt><tt>_Getmouse</tt><br \>
<li><tt>lang fblite</tt> offre une compatibilit&eacute; linguistique FreeBASIC, avec un style de codage plus compatible QBASIC.<br \>
<br \>
</ul><div class="fb_indent">Voir <a href="CompilerDialects.html">Les dialectes du compilateurs</a> pour plus de d&eacute;tails.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item24"></a><b>Pourquoi mon programme se plante-t-il quand je d&eacute;finis un tableau plus grand que xx?</b><br \>
<br \>
<div class="fb_indent">Cela arrive g&eacute;n&eacute;ralement parce que vous avez fait un tableau <i><a href="ProPgStorageClasses.html">automatic</a></i> de longueur fixe trop large et il y a eu un d&eacute;bordement de la pile du programme. Vous avez plusieurs options:<br \>
<br \>
</div><ul><li> si c'est possible, de r&eacute;duisez la taille du tableau <i>automatic</i><br \>
<li> cr&eacute;ez un tableau de longueur variable, en<br \>
<ul><li> d&eacute;finissant le tableau avec  une liste vide d'indices (en utilisant <tt><a href="KeyPgDim.html">Dim</a></tt>), ou<br \>
<li> d&eacute;finissant le tableau avec des indices variables au lieu de litt&eacute;raux num&eacute;riques, <a href="KeyPgConst.html">Constants</a> ou <a href="KeyPgEnum.html">Enums</a> (en utilisant <tt><a href="KeyPgDim.html">Dim</a></tt>), ou en<br \>
<li> d&eacute;finissant le tableau avec  <tt><a href="KeyPgRedim.html">ReDim</a></tt><br \>
</ul><li> r&eacute;servez plus de m&eacute;moire pour la pile du programme en utilisant l'option <tt>-t</tt> de la  <a href="CompilerCmdLine.html">commande en ligne</a> lors de la compilation. la valeur par d&eacute;faut est <tt>-t 1024</tt> (kilo-octets). Note: c'est une mauvaise id&eacute;e d'utiliser, ici, de tr&egrave;s grandes valeurs.<br \>
<li> cr&eacute;ez un tableau <i>static</i> en d&eacute;finissant le tableau avec <tt><a href="KeyPgStatic.html">Static</a></tt> plut&ocirc;t que <tt><a href="KeyPgDim.html">Dim</a></tt> (visible seulement localement, mais globalement pr&eacute;serv&eacute;)<br \>
<li> d&eacute;finissez le tableau avec un acc&egrave;s <tt><a href="KeyPgShared.html">Shared</a></tt> en utilisant <tt><a href="KeyPgDim.html">Dim</a></tt> (ce qui rend le tableau parfaitement global)<br \>
<li> utilisez des <a href="ProPgPointers.html">Pointeurs</a> et <a href="CatPgMemory.html">des fonctions m&eacute;moire</a> telles que <tt><a href="KeyPgAllocate.html">Allocate</a></tt> et <tt><a href="KeyPgDeallocate.html">Deallocate</a></tt> pour g&eacute;rer vous-m&ecirc;me la m&eacute;moire - c'est le moyen privil&eacute;gi&eacute; pour le stockage des grands tampons, mais pas pour les d&eacute;butants.<br \>
<br \>
</ul><div class="fb_indent">Les tableaux <i>Static</i> et <i>variable-length</i> n'utilisent pas la pile du programme pour leurs &eacute;l&eacute;ments de donn&eacute;es, nous n'avons donc pas le probl&egrave;me associ&eacute; des tableaux <i>automatic</i> &agrave; longueur fixe. Voir les <a href="ProPgStorageClasses.html">Classes de stockage</a> pour plus d'informations. Notez que le stockage d'&eacute;normes tampons d&eacute;finis comme <i>static</i> ou l'augmentation de la taille de la pile au-dessus de la valeur par d&eacute;faut n'est pas une tr&egrave;s bonne id&eacute;e, car elle augmente la quantit&eacute; fixe de m&eacute;moire n&eacute;cessaire pour charger et d&eacute;marrer votre programme, m&ecirc;me si la plupart de celle-ci n'est pas utilis&eacute;e plus tard, et cela peut entra&icirc;ner une d&eacute;gradation des performances, ou m&ecirc;me de provoquer un refus de chargement votre programme.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<br \>
<div style="text-align: center;"><b>FreeBasic avanc&eacute;</b></div><br \>
<br \>
<a name="item31"></a><b>Comment puis-je lier &agrave; des biblioth&egrave;ques C?</b><br \>
<div class="fb_indent">Les biblioth&egrave;ques C sont mises en place de la m&ecirc;me mani&egrave;re dans FreeBASIC qu'elles le sont en C. Chaque biblioth&egrave;que fournie avec FreeBASIC a un fichier de base "include" nomm&eacute; "<i>nom-de-la-biblioth&egrave;que.bi</i>" qui utilise la m&eacute;tacommande <a href="KeyPgInclib.html">#inclib</a> pour inclure la biblioth&egrave;que et l'instruction <a href="KeyPgDeclare.html">Declare</a> to d&eacute;clarer les fonctions au sein de la biblioth&egrave;que. FreeBASIC inclut des centaines de fichiers BI, voir la <a href="ExtLibTOC.html">liste compl&egrave;te des en-t&ecirc;tes de biblioth&egrave;que</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item32"></a><b>Puis-je utiliser un d&eacute;bogueur?</b><br \>
<div class="fb_indent">FreeBASIC peut utiliser de pr&eacute;f&eacute;rence un d&eacute;bogueur compatible avec GNU GDB. <br \>
</div><ul><ul><li> Win32: Insight est un "wrapper" (conteneur) convivial pour GDB, voir la <a href="FaqPgWin32.html">FAQ Win32</a>. <br \>
<li> DOS: Soyez averti que DOS a &eacute;galement produit nomm&eacute; "Insight", mais c'est un d&eacute;bogueur en mode r&eacute;el qui n'est pas utilisable avec FreeBASIC, utilisez GDB ou au moins certains d&eacute;bogueur DPMI32.<br \>
<li> Linux: utilisez GDB.<br \>
<br \>
</ul></ul><div class="fb_indent">Voir la <a href="#item999">FAQ des sp&eacute;cificit&eacute;s des OS</a> pour des d&eacute;tails sur votre OS.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item33"></a><b>Quel est le but des fichiers AR.EXE, AS.EXE et LD.EXE fournis avec FB?</b><br \>
<div class="fb_indent">AS.EXE c'est GAS, l'"assembleur GNU". Il est toujours impliqu&eacute; dans la compilation. LD.EXE est le "linkeur GNU", impliqu&eacute; dans la cr&eacute;ation d'ex&eacute;cutables. AR.EXE est l'"archiveur GNU", en fait, un fabricant de biblioth&egrave;ques, crcr&eacute;ant des biblioth&egrave;ques <tt>.A</tt>. <br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item34"></a><b>Y a-t-il une limitation l'ampleur de mes fichiers source?</b><br \>
<div class="fb_indent">Oui, comme FreeBASIC est un compilateur pleinement 32 bits, il peut fonctionner sur des fichiers source, th&eacute;oriquement, jusqu'&agrave; 4GB ou 4294967296 octets, toutefois, votre capacit&eacute; de m&eacute;moire vive (RAM) devra &ecirc;tre nettement sup&eacute;rieure &agrave; la taille de votre source, sinon la compilation ne se terminera pas ou, au moins, sera tr&egrave;s lente. <br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item35"></a><b>Puis-je &eacute;crire un OS avec FreeBasic?</b><br \>
<br \>
<div class="fb_indent">OUI et NON. Si vous insistez pour &eacute;crire un OS et impliquer FB, la r&eacute;ponse est OUI. Si la question est de savoir si c'est une bonne id&eacute;e que vous, encore plus si vous &ecirc;tes un d&eacute;butant, devrait commencer &agrave; coder maintenant un OS en utilisant FB, la r&eacute;ponse est NON. Plusieurs &eacute;cueils sont applicables:<br \>
</div><ul><ul><li> Le d&eacute;veloppement d'un OS est difficile, voir <a href="http://www.osdev.org/wiki/Getting_Started">Getting Started</a>.<br \>
<li> FB ne vous aidera pas &agrave; contourner la n&eacute;cessit&eacute; de s'occuper avec l'assembage, aussi C est peut &ecirc;tre presque impossible &agrave; &eacute;viter.<br \>
<li> Vous ne serez pas en mesure d'utiliser la plupart des fonctions &eacute;prouv&eacute;es de FB, comme les graphiques, fichiers E/S, flux, gestion de la m&eacute;moire, m&ecirc;me les E/S de la console ... contr&ocirc;le de d&eacute;bit, les math&eacute;matiques et la logique. Si vous avez besoin de ces biblioth&egrave;que de fonctions, vous aurez &agrave; les <b> r&eacute;impl&eacute;menter </b>.<br \>
</ul></ul><div class="fb_indent">FreeBASIC s'appuie sur GCC et des informations disponibles sur l'&eacute;laboration d'un OS en C s'appliquent aussi &agrave; FreeBASIC. FB ne vous aidera ni plus ni moins que GCC.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item36"></a><b>Je d&eacute;veloppe un syst&egrave;me d'exploitation, FreeBASIC peut-il &ecirc;tre port&eacute; sur mon OS?</b><br \>
<br \>
Cela d&eacute;pend. Si votre OS atteint au moins les fonctionnalit&eacute;s du DOS avec DPMI32 (console I/O (recherche, plusieurs fichiers ouverts, ...), E/S fichier, gestion de la m&eacute;moire) <b>et</b> dispose d'un portage de GCC, alors la r&eacute;ponse est OUI. Si vous avez au moins un autre compilateur C compatible <b>avec</b> des biblioth&egrave;ques, ce pourrait &ecirc;tre possible. Vous ne pouvez pas raisonnablement porter FB par exemple vers un OS permettant de charger ou enregistrer un fichier dans un seul bloc, ou un OS 16-bit.   <br \>
<br \>
<a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item37"></a><b>FreeBasic permet-il le retour de r&eacute;f&eacute;rences &agrave; partir de fonctions, comme en C++?</b><br \>
<br \>
Depuis la version 0.20.0b, non. Il y a quelques mots-cl&eacute;s, tels que <tt><a href="KeyPgPeek.html">Peek</a></tt> et les <a href="CatPgOpIndexing.html">op&eacute;rateurs d'indexation</a>, par exemple, qui se comportent comme s'ils &eacute;taient des proc&eacute;dures <tt><a href="KeyPgFunction.html">Function</a></tt>qui retourne une r&eacute;f&eacute;rence, comme en C++. Autrement dit, ils &eacute;valuent &agrave; quelque chose qui peut &ecirc;tre utilis&eacute; &agrave; la place d'un objet, un peu comme des <a href="ProPgPassingArguments.html">r&eacute;f&eacute;rences de param&egrave;tres</a>.<br \>
<br \>
Par exemple, si  <tt><i>mystring</i></tt> est de type <tt><a href="KeyPgString.html">String</a></tt> de longueur non nulle, alors <tt><i>mystring[0]</i></tt> correspond &agrave; une r&eacute;f&eacute;rence au premier caract&egrave;re (un <tt><a href="KeyPgUbyte.html">UByte</a></tt>), qui peut &ecirc;tre assign&eacute;e et modifi&eacute;e, transmise &agrave; des proc&eacute;dures, etc.<br \>
<br \>
<tt><a href="KeyPgPeek.html">Peek</a></tt> et les <a href="CatPgOpIndexing.html">op&eacute;rateurs d'indexation</a> sont document&eacute;s comme des proc&eacute;dures <tt><a href="KeyPgFunction.html">Function</a></tt> ou des op&eacute;rateurs qui retourne une valeur, puisque FreeBASIC ne supporte pas encore le retour de r&eacute;f&eacute;rences. Lorsque le retour de r&eacute;f&eacute;rences sera pris en charge, la documentation sera chang&eacute;e pour refl&eacute;ter cela.<br \>
<br \>
<a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item999"></a><div class="fb_sect_title">Voir aussi</div><div class="fb_sect_cont"><br \>
<ul><li> <a href="FaqPgWin32.html">FAQ relative &agrave; Win32</a><br \>
<li> <a href="FaqDOS.html">FAQ relative au DOS</a><br \>
<li> <a href="FaqPgLinux.html">FAQ relative &agrave; Linux</a><br \>
</ul>et<br \>
<ul><li> <a href="FaqPgrtlib.html">FAQ de la biblioth&egrave;que d'ex&eacute;cution de FB</a><br \>
<li> <a href="FaqPggfxlib2.html">Questions Fr&eacute;quemment Pos&eacute;es sur la biblioth&egrave;que graphique de FreeBASIC</a><br \>
<br \>
</ul></div>
</div>
</div> 
</div> 
</body>
</html>
