<html>
<head>
<title>Getting help with FreeBASIC</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Obtenir de l'aide avec FreeBASIC</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Il ya plusieurs options disponibles pour obtenir de l'aide sur FreeBASIC.<br \>
<br \>
<b><u>Le manuel</u></b><br \>
<div class="fb_indent">Ce manuel d'utilisation &eacute;norme est rempli d'informations qui peuvent vous aider &agrave; apprendre &agrave; &eacute;crire des programmes utilisant FreeBASIC.  <br \>
<br \>
Le manuel est disponible en ligne &agrave; <a href="http://www.freebasic.net/wiki">http://www.freebasic.net/wiki</a>.  Il y a un champ de recherche en bas de chaque page pour vous aider &agrave; trouver ce que vous cherchez.<br \>
<br \>
Si vous n'&ecirc;tes pas familier avec FreeBasic ou la documentation, les pages ci-dessous sont de bons endroits pour commencer:<br \>
</div><ul><ul><li> <a href="DocToc.html">Table des mati&egrave;res</a><br \>
<li> <a href="CatPgProgrammer.html">Le guide du programmeur</a><br \>
<li> <a href="ExtLibTOC.html">Index des en-t&ecirc;tes de librairies</a><br \>
<li> <a href="GlossaryIndex.html">Glossaire</a><br \>
<li> <a href="CompilerFAQ.html">FAQ du compilateur</a><br \>
<li> <a href="FaqPggfxlib2.html">FAQ de la librairie graphique</a><br \>
<li> <a href="FaqPgrtlib.html">FAQ du fonctionnement des librairies</a><br \>
<br \>
</ul></ul><div class="fb_indent">Un manuel t&eacute;l&eacute;chargeable (en format CHM) est disponible depuis la page sourceforge du projet &agrave; <a href="http://sourceforge.net/projects/fbc">http://sourceforge.net/projects/fbc</a>. Il dispose d'une table des mati&egrave;res compl&egrave;te, de capacit&eacute;s de recherche, d'un index, et en plus le m&ecirc;me contenu que la version en ligne.<br \>
<br \>
Rechercher dans le manuel en ou hors ligne est un excellent endroit pour commencer &agrave; trouver de l'aide sur la fa&ccedil;on d'&eacute;crire et d'utiliser des programmes FreeBasic.<br \>
<br \>
</div><b><u>Exemples et Code Source</u></b><br \>
<div class="fb_indent">Dans le r&eacute;pertoire ./exemples situ&eacute;s l&agrave; o&ugrave; FreeBasic a &eacute;t&eacute; install&eacute; sur votre syst&egrave;me vous trouverez des centaines d'exemples pr&ecirc;ts &agrave; &ecirc;tre compil&eacute;s et ex&eacute;cut&eacute;s.
  La plupart des exemples de biblioth&egrave;ques externes n&eacute;cessiteront des biblioth&egrave;ques suppl&eacute;mentaires &agrave; t&eacute;l&eacute;charger pour leur permettre de fonctionner.  Voir <a href="ExtLibTOC.html">Index des en-t&ecirc;tes de librairies</a> pour une liste compl&egrave;te.<br \>
<br \>
Les archives officielles de code FreeBASIC sont situ&eacute;es &agrave; <a href="http://www.freebasic.net/arch">http://www.freebasic.net/arch</a>.  Ces archives d'utilisateur ayant contribu&eacute; &agrave; la cr&eacute;ation de biblioth&egrave;ques et d'outils ont des liens vers le code source situ&eacute; sur d'autres sites.<br \>
<br \>
</div><b><u>Tutorials</u></b><br \>
<div class="fb_indent">Des tutoriels sur FreeBASIC cr&eacute;&eacute;s par la communaut&eacute; sont accessibles &agrave; <a href="http://www.freebasic.net/wiki/wikka.php?wakka=CommunityTutorials">http://www.freebasic.net/wiki/wikka.php?wakka=CommunityTutorials</a>.  Quelques-uns de ces tutoriels sont inclus dans ce manuel.<br \>
<br \>
</div><b><u>Forum FreeBASIC</u></b><br \>
<div class="fb_indent">Un forum actif de la communaut&eacute;, ainsi que de nombreux sous-forums peuvent &ecirc;tre trouv&eacute;s &agrave; <a href="http://www.freebasic.net/forum">http://www.freebasic.net/forum</a>.  Le forum a une fonction de recherche qui peut vous aider &agrave; trouver des r&eacute;ponses &agrave; des questions ou des probl&egrave;mes qui ont d&eacute;j&agrave; &eacute;t&eacute; pos&eacute;s et r&eacute;solus.  Faites daAbord une recherche de votre probl&egrave;me, si vous ne trouvez pas la r&eacute;ponse alors postez un message dans un des sous-forums.<br \>
<br \>
</div><b><u>Chat</u></b><br \>
<div class="fb_indent">IRC (ou Internet Relay Chat) est un excellent moyen de discuter avec les d&eacute;veloppeurs et autres utilisateurs, dont certains sont tr&egrave;s bien inform&eacute;s.
  Il existe plusieurs fa&ccedil;ons de se connecter &agrave; IRC, si vous savez ce que vous faites, joignez tout simplement #freebasic sur FreeNode.<br \>
<br \>
Si vous n'avez pas la moindre id&eacute;e ce qu'est l'IRC et que vous avez install&eacute; Java, vous pouvez simplement aller <a href="http://www.freebasic.net/index.php/chat">ici</a>.<br \>
<br \>
Si vous essayez d'obtenir de l'aide, la chose la plus importante est d'&ecirc;tre patient. Parfois, vous ne recevrez pas de r&eacute;ponse tout de suite. Restez dans les parages ou v&eacute;rifiez et que la Communaut&eacute; va essayer de vous aider.<br \>
<br \>
</div>
</div>
</div> 
</div> 
</body>
</html>
