<html>
<head>
<title>Tools used by fbc</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Les outils utilis&eacute;s par FBC</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Les outils externes dont le compilateur FreeBasic (fbc) peut se pr&eacute;valoir au cours du processus de compilation.<br \>
<br \>
<div class="fb_sect_title">Description</div><div class="fb_sect_cont"><br \>
<div class="fb_indent">FreeBasic utilise plusieurs outils pour la compilation du code source en plus le compilateur <tt>fbc</tt>.  Les outils exact utilis&eacute; par <tt>fbc</tt> et comment ils sont invoqu&eacute;s d&eacute;pend de la fa&ccedil;on <tt>fbc</tt> a &eacute;t&eacute; configur&eacute;, la plate-forme d'accueil (o&ugrave; fbc est en cours d'ex&eacute;cution), la plate-forme cible (o&ugrave; le fichier ex&eacute;cutable sera ex&eacute;cut&eacute;) et d'autres options (comme les variables d'environnement et les options de ligne de commande).<br \>
<br \>
FreeBASIC (<tt>fbc</tt>) peut &ecirc;tre configur&eacute; de l'une des deux mani&egrave;res: en mode autonome ou pr&eacute;fix&eacute;.  La version autonome recherche les r&eacute;pertoires par rapport o&ugrave; se trouve l'ex&eacute;cutable.  La version pr&eacute;fix&eacute;e a un chemin cod&eacute; en dur configur&eacute; pour le compilateur indiquant o&ugrave; il s'attend &agrave; trouver d'autres outils et biblioth&egrave;ques.  Pour plus d'informations sur la configuration de FreeBASIC, voir le fichier texte <tt>INSTALL</tt> situ&eacute; dans le r&eacute;pertoire src/compiler des sources  FreeBASIC.<br \>
<br \>
Vous pouvez v&eacute;rifier si votre version install&eacute;e de <tt>fbc</tt> est "autonome" ou "pr&eacute;fix&eacute;e" en appelant <tt>fbc</tt> avec l'option <i><a href="CompilerOptversion.html">-version</a></i> en ligne de commande.<br \>
<br \>
</div><b><u>Standalone = Autonome</u></b><br \>
<div class="fb_indent">Si <tt>fbc</tt> a &eacute;t&eacute; configur&eacute; comme "standalone = autonome", il va rechercher les fichiers par rapport &agrave; l'endroit o&ugrave; se trouve l'ex&eacute;cutable <tt>fbc</tt>.  <tt>fbc</tt> est au "sommet" de l'arborescence des r&eacute;pertoires et recherche les sous-r&eacute;pertoires en-dessous de lui.  Le r&eacute;pertoire "sommet" (par d&eacute;faut, &agrave; l'endroit o&ugrave; est situ&eacute; <tt>fbc</tt>) peut &ecirc;tre modifi&eacute; avec l'option en ligne de commande <i><a href="CompilerOptprefix.html">-prefix</a></i>.  "topdir" des r&eacute;pertoires ci-dessous repr&eacute;sente le r&eacute;pertoire o&ugrave; l'ex&eacute;cutable <tt>fbc</tt> se trouve u le r&eacute;pertoire sp&eacute;cifi&eacute; avec l'option en ligne de commande <i><a href="CompilerOptprefix.html">-prefix</a></i> (si elle a &eacute;t&eacute; utilis&eacute;e). "&lt;target&gt;" se r&eacute;f&egrave;re &agrave; la plate-forme cible ayant le m&ecirc;me nom que celui sp&eacute;cifi&eacute; par l'option <i><a href="CompilerOpttarget.html">-target</a></i>.<br \>
<br \>
S'il n'y a pas de compilation crois&eacute;e, <tt>fbc</tt> cherche dans ces emplacements: <br \>
</div><ul><ul><li> <tt>/topdir/inc</tt><br \>
<li> <tt>/topdir/lib/&lt;target&gt;</tt><br \>
<li> <tt>/topdir/bin/&lt;target&gt;</tt><br \>
<li> gcc est demand&eacute; pour les biblioth&egrave;ques manquantes (actuellement sur Linux/FreeBSD seulement) <br \>
<br \>
</ul></ul><div class="fb_indent">S'il y a compilation crois&eacute;e, <tt>fbc</tt> cherche dans ces emplacements: <br \>
</div><ul><ul><li> <tt>/topdir/inc</tt><br \>
<li> <tt>/topdir/lib/&lt;target&gt;</tt><br \>
<li> <tt>/topdir/bin/&lt;target&gt;</tt><br \>
<li> gcc n'est pas demand&eacute; (seulement le r&eacute;pertoire de la biblioth&egrave;que cible est utilis&eacute;)<br \>
<br \>
</ul></ul><b><u>Prefixed  = Pr&eacute;fix&eacute;</u></b><br \>
<div class="fb_indent">Si <tt>fbc</tt> a &eacute;t&eacute; configur&eacute; comme "prefixed = pr&eacute;fix&eacute;", il va rechercher les fichiers par rapport au pr&eacute;fixe configur&eacute; (en dur dans l'ex&eacute;cutable <tt>fbc</tt>).  "prefix" dans les r&eacute;pertoires ci-dessous repr&eacute;sente le pr&eacute;fixe configur&eacute; ou le r&eacute;pertoire sp&eacute;cifi&eacute; avec l'option de ligne de commande <i><a href="CompilerOptprefix.html">-prefix</a></i> (si elle a &eacute;t&eacute; donn&eacute;e).  "<tt>&lt;target&gt;</tt>" se r&eacute;f&egrave;re &agrave; la plate-forme cible ayant le m&ecirc;me nom que celui sp&eacute;cifi&eacute; par l'option <i><a href="CompilerOpttarget.html">-target</a></i>.<br \>
<br \>
S'il n'y a pas de compilation crois&eacute;e, <tt>fbc</tt> cherche dans ces emplacements: <br \>
</div><ul><ul><li> <tt>/prefix/include/freebasic</tt><br \>
<li> <tt>/prefix/lib/freebasic/&lt;target&gt;</tt><br \>
<li> <tt>/prefix/bin/freebasic/&lt;target&gt;</tt><br \>
<li> gcc est demand&eacute; pour les biblioth&egrave;ques manquantes (actuellement sur Linux/FreeBSD seulement)<br \>
<br \>
</ul></ul><div class="fb_indent">S'il y a compilation crois&eacute;e, <tt>fbc</tt> cherche dans ces emplacements: <br \>
</div><ul><ul><li> <tt>/prefix/include/freebasic</tt><br \>
<li> <tt>/prefix/lib/freebasic/&lt;target&gt;</tt><br \>
<li> <tt>/prefix/bin/freebasic/&lt;target&gt;</tt><br \>
<li> gcc n'est pas demand&eacute; (seulement le r&eacute;pertoire de la biblioth&egrave;que cible est utilis&eacute;)<br \>
<br \>
</ul></ul><b><u>Requ&ecirc;tes GCC</u></b><br \>
<div class="fb_indent">Si <tt>fbc</tt> est incapable de localiser un fichier, il peut invoquer <tt>gcc -print-file-name=&lt;file&gt;</tt> pour interroger l'emplacement du fichier.  Les fichiers suivants sont susceptibles d'&ecirc;tre localis&eacute;s en utilisant gcc:<br \>
</div><ul><ul><li> <tt>crt1.o</tt><br \>
<li> <tt>crtbegin.o</tt><br \>
<li> <tt>crtend.o</tt><br \>
<li> <tt>crti.o</tt><br \>
<li> <tt>crtn.o</tt><br \>
<li> <tt>gcrt1.o</tt><br \>
<li> <tt>libgcc.a</tt><br \>
<li> <tt>libsupc++.a</tt><br \>
<li> <tt>libc.so (Linux seulement)</tt><br \>
<br \>
</ul></ul><b><u>Trouver les binaires</u></b><br \>
<div class="fb_indent"><tt>fbc</tt> appellera d'autres outils (ex&eacute;cutables) dans le cadre du processus de compilation et de liaison.  Ce qui suit est une liste d'outils (ex&eacute;cutables) qui peuvent &ecirc;tre invoqu&eacute;s par <tt>fbc</tt> en fonction de la plate-forme d'accueil, la cible ou le type d'ex&eacute;cutable ou de biblioth&egrave;que &agrave; produire:<br \>
</div><ul><ul><li> <tt>as</tt><br \>
<li> <tt>ar</tt><br \>
<li> <tt>ld</tt><br \>
<li> <tt>gcc</tt><br \>
<li> <tt>GoRC</tt><br \>
<li> <tt>dlltool</tt><br \>
<li> <tt>pexports</tt><br \>
<li> <tt>cxbe</tt><br \>
<br \>
</ul></ul><div class="fb_indent"><tt>fbc</tt> va chercher ces outils de la mani&egrave;re suivante:<br \>
</div><ul><ul><li> Si une variable d'environnement (ayant le m&ecirc;me nom que l'outil sans aucune extension, tout en majuscule) a &eacute;t&eacute; cr&eacute;&eacute;e, il indique explicitement le chemin et le nom de l'ex&eacute;cutable &agrave; appeler.<br \>
<li> Si le fichier (ou un lien symbolique) existe dans <tt>prefix/bin/freebasic/&lt;target&gt;</tt> ou <tt>./bin/&lt;target&gt;</tt> pour la version autonome, alors il l'utilise.<br \>
<li> Sous Linux, si l'outil n'a pas pu &ecirc;tre trouv&eacute; dans <tt>prefix/bin/freebasic/&lt;target&gt;</tt> ou <tt>./bin/&lt;target&gt;</tt> pour la version autonome, <tt>fbc</tt> essaie de l'appeler de toute fa&ccedil;on car il peut &ecirc;tre install&eacute; sur le syst&egrave;me et situ&eacute; sur le chemin PATH.<br \>
<br \>
</ul></ul><div class="fb_indent">"<tt>&lt;target&gt;</tt>" refers to the target platform having the same name as specified by the <i><a href="CompilerOpttarget.html">-target</a></i> option.<br \>
<br \>
</div></div><div class="fb_sect_title">Voir aussi</div><div class="fb_sect_cont"><br \>
<ul><li> <a href="CompilerRunning.html">Utilisation du compilateur FreeBASIC</a><br \>
<li> <a href="CompilerCmdLine.html">Options de ligne de commande du compilateur</a><br \>
<li> <a href="CompilerFAQ.html">FAQ du compilateur</a><br \>
<br \>
</ul></div>
</div>
</div> 
</div> 
</body>
</html>
