<html>
<head>
<title>FreeBASIC and QBasic</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">FreeBASIC et QBasic</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	<br \>
<b>FreeBasic le Successeur</b><br \>
<div class="fb_indent">FreeBasic est con&ccedil;u comme un successeur officiel d'un type de compilateur de haut niveau pour MS-DOS intitul&eacute; "QuickBASIC", qui compilait le code BASIC, un langage de programmation facile &agrave; lire cr&eacute;&eacute; en 1964 par John Kemeny et Thomas Kurtz.  "QB" a &eacute;t&eacute; cr&eacute;&eacute; avec un IDE-interpr&egrave;teur convivial and interpreter qui l'a rendu tr&egrave;s pratique pour &eacute;crire facilement des applications personnalis&eacute;es.  Cette ligne de produits est officiellement poursuivi aujourd'hui sous la forme de "Visual Basic", qui fait partie de la suite de programmation Visual Studio .NET.<br \>
<br \>
<br \>
</div><b>Microsoft et produits BASIC</b><br \>
<div class="fb_indent">Microsoft et BASIC existent bien avant QuickBASIC. En fait, le premier produit de Microsoft a &eacute;t&eacute; un petit interpr&eacute;teur BASIC pour les ordinateurs Altair a publi&eacute; en 1975 et jusqu'au d&eacute;but des ann&eacute;es 1980, Microsoft n'&eacute;tait connu que comme un vendeur de langage. Ils ont port&eacute; leur logiciel BASIC sur plusieurs diff&eacute;rents ordinateurs personnels de l'&eacute;poque et fait ainsi des affaires int&eacute;ressantes.<br \>
<br \>
En ao&ucirc;t 1981 Microsoft a publi&eacute; l'&eacute;tape majeure suivante de sa ligne BASIC, un "BASIC avanc&eacute;", dans le cadre d'une commission pour IBM PC-DOS qui est plus souvent appel&eacute; par le nom de son ex&eacute;cutable, BASICA.EXE. Pour Microsoft et son nouveau MS-DOS, ils ont sorti GW-BASIC, qui a &eacute;t&eacute;, en grande partie, un portage de BASICA qui ne n&eacute;cessite pas d'IBM ROM inclus avec ses syst&egrave;mes.<br \>
<br \>
BASICA et GW-BASIC sont des interpr&egrave;teurs. Les interpr&egrave;teures lisent le code source et l'"interpr&egrave;tent" dans le code informatique en le lisant. Ceci est utile, mais lent. Microsoft, en 1983, r&eacute;alise BASCOM pour MS-DOS. BASCOM compile le code en code machine natif, qui s'ex&eacute;cute beaucoup plus rapidement que le code interpr&eacute;t&eacute;. Cela a &eacute;t&eacute; reconditionn&eacute; avec un IDE et r&eacute;alis&eacute; sous l'appellation QuickBasic en 1985.<br \>
<br \>
<br \>
</div><b>QuickBasic</b><br \>
<div class="fb_indent">De 1985 &agrave; 1992, QuickBASIC est le produit BASIC primaire, publi&eacute; par Microsoft et utilisant BASCOM, et plus tard, Microsoft BASIC Compiler. En 1991, une interpr&egrave;teur all&eacute;g&eacute; souvent consid&eacute;r&eacute; comme le "QuickBASIC 5.0" a &eacute;t&eacute; empaquet&eacute; avec MS-DOS 5.0 et publi&eacute; comme "QBasic 1.1".<br \>
<br \>
QuickBasic comme dialecte BASIC fournit une norme pour les compilateurs BASIC modernes. Il supprime la n&eacute;cessit&eacute; des num&eacute;ros de ligne utilis&eacute;s dans les interpr&egrave;teurs BASIC pr&eacute;c&eacute;dents, est sensible &agrave; la casse et comporte des mots-cl&eacute;s qui sont en anglais courant. QuickBASIC a &eacute;galement une biblioth&egrave;que d'ex&eacute;cution, une biblioth&egrave;que compil&eacute;e par d&eacute;faut et utilisable dans le code source, avec de nombreuses commandes utiles.<br \>
<br \>
En 1991, Microsoft a combin&eacute; un concepteur graphique "drag-and-drop" con&ccedil;u en 1988 appel&eacute; «Ruby» avec QuickBASIC. Ce produit a &eacute;t&eacute; appel&eacute; "Visual Basic" et marque le d&eacute;but de la fin de QuickBASIC. Microsoft a publi&eacute; une derni&egrave;re version de QuickBASIC appel&eacute; "Visual Basic for DOS" en 1992 et abandonn&eacute; le produit &agrave; jamais.<br \>
<br \>
<br \>
</div><b>L'Internet et Deuxi&egrave;me Souffle de QBasic</b><br \>
<div class="fb_indent">Parce que l'interpr&egrave;teur "QBasic 1.1" a &eacute;t&eacute; empaquet&eacute; avec MS-DOS, il a &eacute;t&eacute; r&eacute;alis&eacute; avec chaque copie de DOS jusqu'&agrave; ses derniers jours, Windows 3.1, et m&ecirc;me Windows 95, 98 et ME. Avec l'&eacute;norme succ&egrave;s de Windows, QBasic est devenu l'outil de programmation le plus largement disponible disponible pour les syst&egrave;mes d'exploitation Microsoft.<br \>
<br \>
Lorsque le "World Wide Web" est devenu populaire dans le milieu des ann&eacute;es 90, les programmeurs amateurs de nombreux sites d&eacute;di&eacute;s &agrave; QuickBASIC l'ont utilis&eacute; non pas comme un outil d'application, mais comme une plate-forme pour leurs d&eacute;mos et jeux. Beaucoup de biblioth&egrave;ques assembleur ont &eacute;t&eacute; cr&eacute;&eacute;s pour lui apr&egrave;s que Microsoft ait abandonn&eacute; son soutien, et que ces d&eacute;mos et jeux sont devenus plus complexes, tout comme le "QB communautaire". Depuis le milieu des ann&eacute;es 90, depuis le nouveau mill&eacute;naire &agrave; aujourd'hui, QuickBASIC a connu un v&eacute;ritable culte, modeste mais bien pr&eacute;sent.<br \>
<br \>
Andr&eacute; Victor, cr&eacute;ateur du FreeBASIC, &eacute;tait d'abord connu sur Internet comme l'auteur de plusieurs extensions de QuickBASIC sous la forme de biblioth&egrave;ques. Il a cr&eacute;&eacute; des routines pour am&eacute;liorer la vitesse des op&eacute;rations en virgule flottante, acc&eacute;der &agrave; Internet, utiliser des graphismes SVGA et pour fournir de puissantes fonctionnalit&eacute;s du  langage de programmation QBasic. A la fin de l'&eacute;t&eacute; 2004, il a commenc&eacute; &agrave; travailler sur un compilateur 32-bit utilisant Visual Basic pour MS-DOS.<br \>
<br \>
<br \>
</div><b>FreeBasic est n&eacute;</b><br \>
<div class="fb_indent">FreeBasic a d'abord &eacute;t&eacute; programm&eacute; en VB-DOS, dans le but de se compiler lui-m&ecirc;me. Pour cette raison, sa syntaxe et sa biblioth&egrave;que d'ex&eacute;cution sont con&ccedil;ues pour reproduire la syntaxe et l'ex&eacute;cution de QB dans la mesure o&ugrave; il est pratiqu&eacute; dans un environnement 32-bit Windows. En grande partie, les deux dialectes sont tr&egrave;s similaires et la plupart du code peut &ecirc;tre port&eacute; avec peu ou aucune modification, m&ecirc;me si dans certains cas, des routines d&eacute;pendantes du DOS 16-bit doivent &ecirc;tre r&eacute;&eacute;crites. Les actions r&eacute;sultant du compilateur ont une plus grande similitude avec QB qu'avec n'importe quel compilateur du march&eacute;, y compris Visual Basic.<br \>
<br \>
En raison de son origine "open source", son code bien &eacute;crit et sa similitude avec QB, FreeBasic est devenu populaire parmi la "Communaut&eacute; QB» et ses limites continuent &agrave; cro&icirc;tre, car il re&ccedil;oit plus d'attention et rassemble plus de fonctionnalit&eacute;s que la promesse de d&eacute;placer BASIC dans l'avenir.<br \>
<br \>
</div><br \>
   <br \>

</div>
</div> 
</div> 
</body>
</html>
