<html>
<head>
<title>Debugging</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">D&eacute;bogage</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	<br \>
<div class="fb_indent">Le d&eacute;bogueur est dans le bin\win32 ou les r&eacute;pertoires bin\dos (le fichier <b>GDB</b>.EXE), pour les versions Windows et DOS, respectivement. Il est habituellement d&eacute;j&agrave; install&eacute; dans la plupart des distributions Linux.<br \>
<br \>
(Note: toutes les commandes doivent &ecirc;tre tap&eacute;es sans les guillemets, puis [Entr&eacute;e] doit &ecirc;tre appuy&eacute;.)<br \>
<br \>
</div><ul><li> Compilez les sources avec l'option -g sur la ligne de commande pour ajouter la prise en charge du d&eacute;bogage.<br \>
<li> Chargez-le en utilisant GDB: <tt>"gdb myapplicationname.exe"</tt><br \>
<li> D&eacute;finir les arguments de l'application &agrave; d&eacute;boguer en utilisant: "set args arg1 arg2 argn". Vous pouvez &eacute;galement ex&eacute;cuter GDB et passer les arguments directement &agrave; l'application &agrave; d&eacute;boguer: "gdb --args myapp.exe arg1 arg2 arg3".<br \>
<li> Si l'ex&eacute;cutable n'est pas dans le m&ecirc;me r&eacute;pertoire que les fichiers source o&ugrave; il a &eacute;t&eacute; compil&eacute;, tapez: <tt>"dir path/to/my/application/sources"</tt>.<br \>
<li> Placez un point d'arr&ecirc;t dans la premi&egrave;re ligne &agrave; l'aide: "b main". Pour placer un point d'arr&ecirc;t dans une fonction appel&eacute;e "abc" utilisez: "b ABC" (note: tout en majuscules, GDB est sensible &agrave; la casse par d&eacute;faut, mais vous pouvez utiliser la commande "set language pascal" pour passer GDB au mode insensible &agrave; la casse).<br \>
<li> Tapez "r" pour lancer l'application.<br \>
<li> Tapez "n" pour sauter les appels de fonction. Maintenez la touche [Entr&eacute;e] pour passer &agrave; la ligne suivante.<br \>
<li> Tapez "s" pour entrer dans les appels de fonction. Idem que ci-dessus.<br \>
<li> Tapez "c" pour continuer l'ex&eacute;cution jusqu'au prochain point d'arr&ecirc;t.<br \>
<li> Utilisez "print ABC" pour voir le contenu de la variable appel&eacute;e "abc". GDB supporte pointeur/d&eacute;r&eacute;f&eacute;rencement de pointeur, l'indexation et l'arithm&eacute;tique aussi, donc "print *MYPOINTER" fonctionnera &eacute;galement. (note: les variables non d&eacute;clar&eacute;es ou celles avec les suffixes % & ! # $ ne peuvent pas &ecirc;tre PRINT&eacute;es).<br \>
<li> Utilisez "disp ABC" pour afficher le contenu d'une variable appel&eacute;e "abc".<br \>
<li> Utilisez "watch ABC" pour arr&ecirc;ter &agrave; chaque fois qu'une calle variable appel&eacute;e "abc" est modifi&eacute;e.<br \>
<li> Utilisez "r" again to restart the application when finished.<br \>
<li> Tapez "q" pour quitter.<br \>
<li> Tapez "help" pour voir une liste de commandes, il y en a beaucoup d'autres.<br \>
<br \>
<br \>
<br \>
</ul>
</div>
</div> 
</div> 
</body>
</html>
