<html>
<head>
<title>Library Headers Index</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Index des en-t&ecirc;tes de biblioth&egrave;ques</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Index des fichiers d'en-t&ecirc;te distribu&eacute;s avec FreeBasic pour une utilisation avec des biblioth&egrave;ques externes.  Seules les en-t&ecirc;tes (fichiers include) sont distribu&eacute;es avec FreeBasic.  Pour obtenir une biblioth&egrave;que externe n&eacute;cessaire, veuillez consulter le lien indiqu&eacute; ci-dessous sur l'information pour chaque biblioth&egrave;que.<br \>
<br \>
<b><u>Graphiques</u></b><br \>
<div class="fb_indent"><a href="ExtLiballegro.html">allegro</a> - Biblioth&egrave;que de programmation de jeux.<br \>
<a href="ExtLibDUGL.html">DUGL</a> - Biblioth&egrave;que graphique et jeu pour DOS.<br \>
<a href="ExtLibcaca.html">caca</a> - Une biblioth&egrave;que ASCII d'art couleur. <br \>
<a href="ExtLibcairo.html">cairo</a> - Biblioth&egrave;que graphique 2D avec le support de plusieurs p&eacute;riph&eacute;riques de sortie.<br \>
<a href="ExtLibcgui.html">cgui</a> - Biblioth&egrave;que pour faire des interfaces graphiques de mani&egrave;re simple.<br \>
<a href="ExtLibcurses.html">Curses</a> - Biblioth&egrave;que console normalis&eacute;e d'interface utilisateur.<br \>
<a href="ExtLibdislin.html">dislin</a> - Biblioth&egrave;que de sous-routines et de fonctions qui affichent les donn&eacute;es sous forme graphique.<br \>
<a href="ExtLibfreeimage.html">FreeImage</a> - Biblioth&egrave;que Open Source pour la prise en charge de formats graphiques populaires.<br \>
<a href="ExtLibfreetype2.html">Freetype2</a> - Un moteur de polices libre, de haute qualit&eacute; et portable.<br \>
<a href="ExtLibgd.html">gd</a> - Biblioth&egrave;que "code source libre" pour la cr&eacute;ation dynamique d'images par les programmeurs.<br \>
<a href="ExtLibgiflib.html">gif_lib</a> - GIFLIB est un ensemble d'outils portables et une biblioth&egrave;que de routines pour travailler avec des images GIF.<br \>
<a href="ExtLibgrx.html">grx</a> - Biblioth&egrave;que graphique 2D.<br \>
<a href="ExtLibgtk.html">GTK+</a> - Biblioth&egrave;que graphique multiplate-forme, interface utilisateur.<br \>
<a href="ExtLibIL.html">IL</a> - Une Biblioth&egrave;que image compl&egrave;te multi-plateforme.<br \>
<a href="ExtLibIUP.html">IUP</a> - Bo&icirc;te &agrave; outils portable pour cr&eacute;er des interfaces utilisateur.<br \>
<a href="ExtLibjapi.html">japi</a> - Bo&icirc;te &agrave; outils GUI "code source libre" utilisant la bo&icirc;te &agrave; outils Java AWT.<br \>
<a href="ExtLibjpeglib.html">jpeglib</a> - Biblioth&egrave;que multiplate-forme pour la lecture/&eacute;criture des images jpeg.<br \>
<a href="ExtLibjpgalleg.html">jpgalleg</a> - JPGalleg est un petit module compl&eacute;mentaire qui ajoute capacit&eacute;s de traitement des images JPG &agrave; la biblioth&egrave;que Allegro.<br \>
<a href="ExtLiblibpng.html">libpng</a> - Permet la lecture et l'&eacute;criture des images PNG.<br \>
<a href="ExtLibOpenGL.html">OpenGL</a> - Biblioth&egrave;que graphique 3D multiplate-forme.<br \>
<a href="ExtLibpdflib.html">pdflib</a> - PDFlib est un outil de d&eacute;veloppement qui permet &agrave; votre logiciel l'utilisation de PDF.<br \>
<a href="ExtLibSDL.html">SDL</a> - Biblioth&egrave;que multiplate-forme multim&eacute;dia.<br \>
<a href="ExtLibtinyptc.html">tinyptc</a> - Une petite biblioth&egrave;que graphique permettant l'utilisation facile du tampon vid&eacute;o.<br \>
<a href="ExtLibwxc.html">wx-c</a> - Biblioth&egrave;que graphique d'interface utilisateur multiplate-forme.<br \>
<br \>
</div><b><u>Base de donn&eacute;es</u></b><br \>
<div class="fb_indent"><a href="ExtLibmysql.html">mysql</a> - Moteur de base de donn&eacute;es de haute qualit&eacute; couramment utilis&eacute;.<br \>
<a href="ExtLibpostgresql.html">postgresql</a> - Logiciel libre de syst&egrave;me de gestion de base de donn&eacute;es, objet-relationnel.<br \>
<a href="ExtLibsqlite.html">sqlite</a> - Petite biblioth&egrave;que C qui impl&eacute;mente un moteur  de base de donn&eacute;es SQL interne, embarquable, sans configuration.<br \>
<br \>
</div><b><u>Musique / son</u></b><br \>
<div class="fb_indent"><a href="ExtLibbass.html">BASS</a> - Biblioth&egrave;que audio pour une utilisation sous Windows avec une version b&ecirc;ta pour Linux.<br \>
<a href="ExtLibbassmod.html">BASSMOD</a> - BASSMOD est seulement un MOD (XM, IT, S3M, MOD, MTM, UMX) version de BASS<br \>
<a href="ExtLibfmod.html">FMOD</a> - Biblioth&egrave;que audio prenant en charge &agrave; peu pr&egrave;s n'importe quel format.<br \>
<a href="ExtLibal.html">OpenAL</a> - API audio 3D multiplate-forme.<br \>
<br \>
</div><b><u>Aide au d&eacute;veloppement</u></b><br \>
<div class="fb_indent"><a href="ExtLibbfd.html">bfd</a> - Permet aux applications d'utiliser les m&ecirc;mes routines pour fonctionner sur des fichiers objets quel que soit le format de fichier objet.<br \>
<a href="ExtLibCUnit.html">CUnit</a> - Syst&egrave;me l&eacute;ger pour l'&eacute;criture, l'administration et l'ex&eacute;cution des tests unitaires en C.<br \>
<a href="ExtLibgdsl.html">gdsl</a> -"Generic Data Structures Library" est une collection de routines pour les structures de donn&eacute;es g&eacute;n&eacute;riques.<br \>
<a href="ExtLibaspell.html">GNU ASpell</a> - V&eacute;rificateur orthographique libre.<br \>
<br \>
</div><b><u>Langages int&eacute;grables</u></b><br \>
<div class="fb_indent"><a href="ExtLibjni.html">jni</a> - L'interface de programmation standard pour l'&eacute;criture de m&eacute;thodes Java natif et l'incorporation de la machine virtuelle Java * dans les applications natives.<br \>
<a href="ExtLibLua.html">Lua</a> - Moteur de script l&eacute;ger embarquable utilisant le langage Lua.<br \>
<a href="ExtLibspidermonkey.html">spidermonkey</a> - Moteur javascript int&eacute;grable.<br \>
<br \>
</div><b><u>Cryptographie</u></b><br \>
<div class="fb_indent"><a href="ExtLibcryptlib.html">cryptlib</a> - Une trousse d'outils de s&eacute;curit&eacute; puissante qui permet m&ecirc;me aux programmeurs inexp&eacute;riment&eacute;s crypto d'ajouter facilement des services de chiffrement et d'authentification &agrave; leurs logiciels.<br \>
<br \>
</div><b><u>Math&eacute;matiques</u></b><br \>
<div class="fb_indent"><a href="ExtLibbigint.html">big_int</a> - Biblioth&egrave;que pour utiliser des entiers de taille arbitraire.<br \>
<a href="ExtLibgmp.html">gmp</a> - Biblioth&egrave;que libre pour l'arithm&eacute;tique de pr&eacute;cision arbitraire, op&eacute;rant sur des entiers sign&eacute;s, des nombres rationnels et nombres &agrave; virgule flottante.<br \>
<a href="ExtLibgsl.html">gsl</a> - Fournit un large &eacute;ventail de routines math&eacute;matiques tels que les g&eacute;n&eacute;rateurs de nombres al&eacute;atoires, des fonctions sp&eacute;ciales et des "des moindres carr&eacute;s".<br \>
<a href="ExtLibnewton.html">Newton</a> - Une solution int&eacute;gr&eacute;e pour la simulation en temps r&eacute;el des environnements physiques. <br \>
<a href="ExtLibode.html">ode</a> - Biblioth&egrave;que "code source libre" haute performance pour la simulation dynamique des corps rigides.		<br \>
<br \>
</div><b><u>R&eacute;seaux</u></b><br \>
<div class="fb_indent"><a href="ExtLibcgiutil.html">cgi-util</a> - Petite biblioth&egrave;que C pour cr&eacute;er des programmes CGI pour site web.<br \>
<a href="ExtLibcurl.html">curl</a> - Biblioth&egrave;que de transfert URL c&ocirc;t&eacute; client libre et facile &agrave; utiliser supportant presque tous les protocoles.<br \>
<a href="ExtLibFastCGI.html">FastCGI</a> - Extension libre de CGI qui fournit des performances &eacute;lev&eacute;es sans les limitations d'API serveur sp&eacute;cifique.<br \>
<br \>
</div><b><u>eXtensible Markup Language (XML)</u></b><br \>
<div class="fb_indent"><a href="ExtLibexpat.html">expat</a> - Biblioth&egrave;que flux orient&eacute;e analyseur XML avec plusieurs fonctionnalit&eacute;s utiles.<br \>
<a href="ExtLiblibxml.html">libxml</a> - Biblioth&egrave;que standard d'acc&egrave;s aux de fichiers xml.<br \>
<a href="ExtLiblibxslt.html">libxslt</a> - XSLT est lui-m&ecirc;me un langage XML pour d&eacute;finir des transformations XML.<br \>
<a href="ExtLibmxml.html">mxml</a> - Petite biblioth&egrave;que d'analyse XML que vous pouvez utiliser pour lire les donn&eacute;es XML et les fichiers de donn&eacute;es XML dans votre application.<br \>
<br \>
</div><b><u>Expressions r&eacute;guli&egrave;res</u></b><br \>
<div class="fb_indent"><a href="ExtLibpcre.html">pcre</a> - Filtrage d'expression r&eacute;guli&egrave;res utilisant la m&ecirc;me syntaxe que Perl.<br \>
<a href="ExtLibtre.html">tre</a> - Biblioth&egrave;que l&eacute;g&egrave;re, robuste, efficace et conforme aux expressions r&eacute;guli&egrave;res POSIX.<br \>
<br \>
</div><b><u>Compression</u></b><br \>
<div class="fb_indent"><a href="ExtLibLzo.html">LZO</a> - Compression rapide et d&eacute;compression tr&egrave;s rapide.<br \>
<a href="ExtLibquicklz.html">QuickLZ</a> - Biblioth&egrave;que de compression tr&egrave;s rapide<br \>
<a href="ExtLibzlib.html">zlib</a> - Biblioth&egrave;que de compression sans perte de donn&eacute;es non handicap&eacute;e par des brevets.<br \>
<br \>
</div><b><u>Sp&eacute;cificit&eacute;s syst&egrave;me</u></b><br \>
<div class="fb_indent"><a href="ExtLibCRT.html">C Runtime Library</a><br \>
<a href="ExtLibdos.html">DOS API</a><br \>
<a href="ExtLibdisphelper.html">disphelper</a> - Biblioth&egrave;que de d'assistance pour utiliser des objets COM en pur langage C. <br \>
<a href="ExtLibwindows.html">API Windows</a><br \>
<br \>
</div><b><u>Biblioth&egrave;ques contribution de l'utilisateur</u></b><br \>
<div class="fb_indent">Visit http://www.freebasic.net/arch/ pour d'autres biblioth&egrave;ques.<br \>
<br \>
</div>

</div>
</div> 
</div> 
</body>
</html>
