<html>
<head>
<title>Frequently Asked FB Runtime Library Questions</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">FAQ de la biblioth&egrave;que d'ex&eacute;cution de FB</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	<br \>
<a name="item0"></a><br \>
<b>Questions sur la biblioth&egrave;que d'ex&eacute;cution de FreeBASIC:</b><br \>
<br \>
<div class="fb_indent"><b>- <a href="#item1">Comment puis-je jouer des sons?</a></b><br \>
<b>- <a href="#item2">Comment puis-je acc&eacute;der aux ports s&eacute;rie?</a></b><br \>
<b>- <a href="#item3">Comment puis-je imprimer?</a></b><br \>
<b>- <a href="#item4">Comment puis-je acc&eacute;der aux ports mat&eacute;riels?</a></b><br \>
<b>- <a href="#item5">Quel est le comportement de cha&icirc;nes pass&eacute;es "byval"?</a></b><br \>
<br \>
</div><br \>
<br \>
<br \>
<div style="text-align: center;"><b>Questions sur la biblioth&egrave;que d'ex&eacute;cution de FreeBASIC</b></div><br \>
<br \>
<a name="item1"></a><b> Comment puis-je jouer des sons?</b><br \>
<div class="fb_indent">Des mots-cl&eacute;s sonores de QB seul BEEP est g&eacute;r&eacute; dans FB. <br \>
Si le haut-parleur PC est n&eacute;cessaire, il doit &ecirc;tre programm&eacute; en utilisant IN et OUT. Voir l'exemple dans le mot-cl&eacute; OUT pour un remplacement de SOUND.<br \>
Il existe une biblioth&egrave;que appel&eacute;e QBSound qui permet d'&eacute;muler la capacit&eacute; de QB d'utiliser PLAY en fond sonore, pour des airs dans des cha&icirc;nes cod&eacute;es, en utilisant la carte son de synth&eacute;tiseur.<br \>
Si c'est de jouer des fichiers .wav ou .mp3 gr&acirc;ce &agrave; une carte son, des biblioth&egrave;ques externes comme FMOD ou BASS peut &ecirc;tre utilis&eacute;es sous Linux et Windows. Pour DOS voir la <a href="FaqDOS.html">FAQ DOS</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item2"></a><b>Comment puis-je acc&eacute;der aux ports s&eacute;rie?</b><br \>
<br \>
<div class="fb_indent"><b>DOS</b><br \>
Voir la <a href="FaqDOS.html">FAQ DOS</a>.<br \>
<br \>
<b>Windows et Linux</b><br \>
Voir <a href="KeyPgOpenCom.html">Open Com</a>.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item3"></a><b>Comment puis-je imprimer?</b><br \>
<div class="fb_indent">Depuis la version 0.15, FB accepte la sortie de caract&egrave;res vers l'imprimante. <br \>
Pour imprimer des graphiques deux approches sont possibles:<br \>
</div><ul><li> Pr&eacute;traiter les graphismes, programmer l'imprimante et envoyer les pixels dans FB. Ceci est portable c&ocirc;t&eacute; OS mais d&eacute;pend du mod&egrave;le d'imprimante. La seule fa&ccedil;on pour DOS, voir aussi <a href="FaqDOS.html">FAQ DOS</a>.<br \>
<li> Dans Windows et Linux il existe des appels d'API sp&eacute;cifiques. Ceci n'est pas portable c&ocirc;t&eacute; OS mais le pilote OS de l'imprimante rend l'imprimante independante. <br \>
<br \>
</ul><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item4"></a><b>Comment puis-je acc&eacute;der aux ports mat&eacute;riels?</b><br \>
<br \>
<div class="fb_indent">INP, OUT et WAIT V0.15 QB sont impl&eacute;ment&eacute;s. <br \>
GfxLib intercepte les appels &agrave; certains ports VGA pour &eacute;muler la large utilisation de la manipulation de la Palete dans QB et les m&eacute;thodes de vsync. Ainsi les ports &amp;H3DA, &amp;H3C7, &amp;H3C8 et &amp;H3C9 ne sont pas accessibles si GfxLib est utilis&eacute;. Tous les autres ports sont accessibles.<br \>
Aucun soin suppl&eacute;mentaire n'est n&eacute;cessaire pour utiliser INP et OUT sous Linux ou DOS. Pour que la version Windows le pilote de p&eacute;riph&eacute;rique requis est install&eacute; &agrave; chaque fois que le premier programme est ex&eacute;cut&eacute; dans une session Windows; cela n&eacute;cessite des droits d'administrateur pour cette premi&egrave;re ex&eacute;cution ou le programme se terminera avec une erreur.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item5"></a><b>Quel est le comportement de cha&icirc;nes pass&eacute;es "byval"?</b><br \>
<br \>
<div class="fb_indent">Cet article a &eacute;t&eacute; &eacute;crit le 30.01.2007.<br \>
<br \>
Une <a href="KeyPgString.html">String</a> FreeBASIC est essentiellement un type int&eacute;gr&eacute; d&eacute;fini par l'utilisateur qui, entre autres choses, contient un pointeur vers les donn&eacute;es cha&icirc;ne et sa longueur. Ce type est appel&eacute; un "descripteur" en interne, et c'est ce descripteur qui est pass&eacute; aux proc&eacute;dures quand les param&egrave;tres sont pass&eacute;s par r&eacute;f&eacute;rence.<br \>
Lorsqu'ils sont pass&eacute;s par valeur, cependant, ce sont les donn&eacute;es r&eacute;elles de la cha&icirc;ne qui sont pass&eacute;es, et non pas le descripteur. En interne, la cha&icirc;ne de donn&eacute;es est termin&eacute;e par le caract&egrave;re NULL (chr(0)). Lorsqu'une <a href="KeyPgString.html">String</a> temporaire est cr&eacute;&eacute;e pour une proc&eacute;dure, FreeBASIC copie les donn&eacute;es de la cha&icirc;ne transmise jusqu'au premier caract&egrave;re NULL. Si l'argument pass&eacute; <a href="KeyPgString.html">String</a> contient des caract&egrave;res NULL dans la cha&icirc;ne, alors le reste de la cha&icirc;ne de donn&eacute;es apr&egrave;s le premier NULL n'est pas copi&eacute; et la cha&icirc;ne est tronqu&eacute;e. Vous courez &eacute;galement le risque d'&eacute;crire en dehors des limites de la m&eacute;moire allou&eacute;e.<br \>
Ce comportement sera corrig&eacute; et agira comme il se doit: un descripteur temporaire sera cr&eacute;&eacute; pour la proc&eacute;dure et une "copie en profondeur" de ses champs sera effectu&eacute;e (notamment, les donn&eacute;es de la cha&icirc;ne enti&egrave;re se seront copi&eacute;es dans la nouvelle m&eacute;moire et le nouveau descripteur pointera vers cette m&eacute;moire).<br \>
Pour plus de s&eacute;curit&eacute;, passez les <a href="KeyPgString.html">String</a> par r&eacute;f&eacute;rence. Si vous voulez simuler le comportement correct de passer une <a href="KeyPgString.html">String</a> par valeur, soit 1) cr&eacute;er une <a href="KeyPgString.html">String</a> temporaire, l'initialiser avec la <a href="KeyPgString.html">String</a> que vous d&eacute;sirez passer et passer la <a href="KeyPgString.html">String</a> temporaire par r&eacute;f&eacute;rence, ou 2) passer la <a href="KeyPgString.html">String</a> par r&eacute;f&eacute;rence et cr&eacute;er la proc&eacute;dure et l'initialiser avec une <a href="KeyPgString.html">String</a> temporaire et travailler avec la <a href="KeyPgString.html">String</a> temporaire.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
Voir aussi:<br \>
<ul><li> <a href="CompilerFAQ.html">FAQ du compilateur</a><br \>
<li> <a href="FaqPggfxlib2.html">FAQ de la biblioth&egrave;que graphique de FreeBASIC</a><br \>
</ul>et<br \>
<ul><li> <a href="FaqPgWin32.html">FAQ Win32</a><br \>
<li> <a href="FaqDOS.html">FAQ DOS</a><br \>
<br \>
</ul><br \>

</div>
</div> 
</div> 
</body>
</html>
