<html>
<head>
<title>Windows Related FAQ</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">FAQ relative &agrave; Windows</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	<br \>
<a name="item0"></a><br \>
<b>Windows:</b><br \>
<br \>
<div class="fb_indent"><b>- <a href="#item01">Quel IDE est disponible pour Windows?</a></b><br \>
<b>- <a href="#item02">Puis-je me d&eacute;barrasser de l'&eacute;cran console/DOS dans une application graphique?</a></b><br \>
<b>- <a href="#item03">Mon programme de GUI ne fait rien lorsque je lance/compile le programme mais je re&ccedil;ois une erreur de permission refus&eacute;e dans le linkeur</a></b><br \>
<b>- <a href="#item04">Comment faire pour d&eacute;boguer?</a></b><br \>
<b>- <a href="#item05">Pourquoi Windows refuse d'ex&eacute;cuter mon code en utilisant OUT et/ou INP?</a></b><br \>
<b>- <a href="#item06">J'obtiens l'erreur 'Cannot start blah.exe because xxxx.dll was not found.' ou similaire. Qu'est-ce qui manque?</a></b><br \>
<b>- <a href="#item07">FreeBASIC fonctionne-t-il sous Windows Vista?</a></b><br \>
<b>- <a href="#item08">O&ugrave; puis-je trouver des tutoriaux sur la programmation GUI sous Windows?</a></b><br \>
<b>- <a href="#item09">Y a-t-il des constructeurs de code Windows GUI pour FB?</a></b>	<br \>
<br \>
</div><br \>
<br \>
<br \>
<div style="text-align: center;"><b>Questions FreeBASIC et Windows </b></div><br \>
<br \>
<a name="item01"></a><b>Quel IDE est disponible pour Windows?</b><br \>
<br \>
<div class="fb_indent">A l'heure actuelle, trois IDE complets en vogue ont &eacute;t&eacute; d&eacute;velopp&eacute;s sp&eacute;cifiquement pour FB: <a href="http://fbide.freebasic.net/">FBIde</a> (pas mis &agrave; jour, &eacute;viter d'utiliser d'anciennes versions de FBC livr&eacute;es avec lui), <a href="http://fbedit.freebasic.net/">FbEdit</a> et <a href="http://www.planetsquires.com/jellyfishpro_freebasic.htm">JellyFishPro</a>.Ces IDE n&eacute;cessitent une configuration minimale -comme le chemin vers le compilateur- pour travailler. <br \>
Vous pouvez &eacute;galement t&eacute;l&eacute;charger <a href="http://fbide.freebasic.net/">FBIde</a> et <a href="http://fbedit.freebasic.net/">FbEdit</a> dans un ensemble (Editeur + Compilateur) qui installe tout en une seule op&eacute;ration. Mais la version embarqu&eacute;e du compilateur peut &ecirc;tre p&eacute;rim&eacute;e.<br \>
Des IDE commerciaux d'"utilisation g&eacute;n&eacute;rale" peuvent &ecirc;tre utilis&eacute;s avec FreeBASIC mais peuvent n&eacute;cessiter une extension de configuration. Ils sont pratiques pour la programmation multi-langage, car ils fournissent une interface utilisateur unifi&eacute;e.<br \>
Les instructions d'installation de FB JFish Pro, FBIde et FbEdit sont disponibles:<br \>
   - <a href="http://www.freebasic.net/forum/viewtopic.php?t=10350">Guide d'installation d'un IDE pour Windows</a><br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a>	<br \>
<br \>
<a name="item02"></a><b>Puis-je me d&eacute;barrasser de l'&eacute;cran console/DOS dans une application graphique?</b><br \>
<div class="fb_indent">Oui. Vous devez fournir &agrave; FreeBASIC la bonne commande lorsque vous compilez votre programme.<br \>
</div><ul><li> Si vous compilez &agrave; partir d'une invite de commande, il suffit d'ajouter <tt>"-s gui"</tt> &agrave; la fin, comme ceci <tt>"fbc myprg.bas -s gui"</tt><br \>
<li> Si vous compilez dans un IDE sp&eacute;cifique, vous devez modifier "Compiler Defaults" (valeurs par d&eacute;faut du compilateur). <br \>
<ul><li> Dans Jelly-Fish Pro, "Compiler-&gt;Set Compiler Defaults-&gt;Compiler Options". Add "-s gui" (NO QUOTES).<br \>
<li> Dans FbEdit s&eacute;lectionnez Windows GUI dans la liste d&eacute;roulante des objectifs &agrave; droite de la barre d'outils.<br \>
<br \>
</ul></ul><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item03"></a><b>Mon programme de GUI ne fait rien lorsque je lance/compile le programme mais je re&ccedil;ois une erreur de permission refus&eacute;e dans le linkeur</b><br \>
<div class="fb_indent">Le probl&egrave;me peut &ecirc;tre li&eacute; &agrave; la question pr&eacute;c&eacute;dente. Si un programme tente un PRINT et qu'il a &eacute;t&eacute; compil&eacute; avec <tt>"-s gui"</tt> il se bloquera, car aucune console n'est disponible. Si le PRINT est &eacute;mis avant que la premi&egrave;re fen&ecirc;tre ne soit enregistr&eacute;e/ouverte, rien n'appara&icirc;tra &agrave; l'&eacute;cran ou dans la barre des t&acirc;ches. Le programme en cours ne peut qu'&ecirc;tre vu dans (et tu&eacute; &agrave; partir du) le gestionnaire des t&acirc;ches de l'onglet du processus. Si une nouvelle compilation est essay&eacute;e avant de tuer le processus, vous aurez "Permission denied" car le compilateur tente de modifier un "programme .exe" en cours d'ex&eacute;cution.<br \>
Dans les programmes GUI Windows n' utilisez pas les commandes de la console. Utilisez "MessageBox" ou "print" vers un fichier "log" pour &eacute;mettre un message d'erreur vers l'utilisateur. V&eacute;rifiez qu'aucun PRINT vers la console, utilis&eacute; pour le d&eacute;bogage, n'est pas compil&eacute; dans la version finale. <br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item04"></a><b>Comment faire pour d&eacute;boguer?</b><br \>
<div class="fb_indent">FreeBASIC peut utiliser n'importe quel d&eacute;bogueur compatible avec GNU GDB. Le d&eacute;bogueur Insight Win32 est un "wrapper" convivial pour GDB. <br \>
</div><ul><li> T&eacute;l&eacute;chargez Insight &agrave; partir de <a href="http://prdownloads.sourceforge.net/dev-cpp/Insight_Binary.DevPak?download">Dev-C++</a><br \>
<li> Renommez le fichier Insight.tar.bz2 et d&eacute;compressez-le dans un dossier vide.<br \>
<li> Compilez votre programme avec l'optio -g<br \>
<li> Lancez &lt;Your_Insight_Dir&gt;\bin\usr\bin\Insight.exe<br \>
<li> Utilisez File&gt;Open pour charger votre programme dans Insight<br \>
<li> A partir de l&agrave;, vous pouvez "watch" = examiner, "set breakpoints" = placer des points d'arr&ecirc;t, "step" = avancer pas &agrave; pas, examiner la m&eacute;moire et les registres. Lisez l'aide d'Insight.<br \>
<br \>
</ul><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item05"></a><b>Pourquoi Windows refuse d'ex&eacute;cuter mon code en utilisant OUT et/ou INP?</b><br \>
<div class="fb_indent">Windows requiert qu'un pilote soit install&eacute; pour acc&eacute;der aux ports mat&eacute;riels. Les programmes FB-Win32 qui utilisent INP et OUT incluent un pilote interne qui s'installe temporairement pour la session. Windows ne permet uniquement qu'aux utilisateurs avec des droits administrateur d'ex&eacute;cuter des installations de pilote. Cela signifie que si habituellement vous ex&eacute;cutez vos sessions Windows sans droits d'administrateur, vous aurez &agrave; utiliser la commande Windows RUNAS, sur la ligne de commande, pour ex&eacute;cuter votre programme pour la premi&egrave;re fois, lors de chaque session afin que Windows permette l'installation du pilote.<br \>
Si ce comportement n'est pas acceptable, vous pouvez utiliser une biblioth&egrave;que externe <a href="http://www.winfordeng.com/products/portio32/">PortIO32</a> qui installe un pilote de port permanent.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item06"></a><b>J'obtiens l'erreur 'Cannot start blah.exe because xxxx.dll was not found.' ou similaire. Qu'est-ce qui manque?</b><br \>
<div class="fb_indent">Vous essayez d'ex&eacute;cuter un programme utilisant une biblioth&egrave;que tierce partie qui r&eacute;side dans une DLL qui n'est pas install&eacute;e sur votre syst&egrave;me.<br \>
FreeBASIC est livr&eacute; avec les en-t&ecirc;tes et les "wrappers" n&eacute;cessaires pour coder pour un grand nombre de librairies tierces, mais ne fournit pas les fichiers r&eacute;els des dll d'ex&eacute;cution.<br \>
Vous devez les t&eacute;l&eacute;charger et installer &agrave; partir de leur page d'accueil. Rechercher dans <a href="http://www.freebasic.net/forum/viewtopic.php?t=788">le sous-forum des biblioth&egrave;ques</a> l'URL des pages d'accueil des biblioth&egrave;ques fournies. Vous avez besoin des binaires pour les biblioth&egrave;ques Win32. Si vous voulez d&eacute;velopper des programmes avec les "libs" vous aurez aussi besoin des la documentation.<br \>
Lors de la publication du code compil&eacute; c'est une bonne pratique que de fournir les dll tierce partie n&eacute;cessaires &agrave; son fonctionnement.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item07"></a><b>FreeBASIC fonctionne-t-il sous Windows Vista?</b><br \>
<div class="fb_indent">Oui. (Ecrivez-moi!!!)<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item08"></a><b>O&ugrave; puis-je trouver des tutoriaux sur la programmation GUI sous Windows?</b><br \>
<div class="fb_indent">Voir les r&eacute;ponses &agrave; cette question dans ce <a href="http://www.freebasic.net/forum/viewtopic.php?p=89225">thread du forum</a><br \>
Une utilisation plus avanc&eacute;e requiert une consultation fr&eacute;quente de <a href="http://msdn2.microsoft.com/en-us/library/aa139672.aspx">Microsoft Developers Network</a>. Une installation locale de la r&eacute;f&eacute;rence de l'API est possible, recherche de Microsoft pour la "Platform SDK" (un t&eacute;l&eacute;chargement &eacute;norme) et installez simplement la documentation.<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<a name="item09"></a><b>Y a-t-il des constructeurs de code Windows GUI pour FB? </b>	<br \>
<div class="fb_indent">Oui, il y a des d&eacute;veloppements 3&egrave;me partie g&eacute;n&eacute;rant le code API Windows &agrave; partir d'un concepteur de fen&ecirc;tres Visual Basic. Aucun d'entre eux n'est Open source:<br \>
    <a href="http://www.freewebs.com/fielden/">Jerry Fielden' Ezeegui</a> utilise une interface "graphique" en mode texte pour vous permettre de construire votre code.<br \>
<a href="http://mrhx.ucoz.com/load/">mrhx Software's VISG</a> a une interface utilisateur plus classique.<br \>
Moins utile peut &ecirc;tre les &eacute;diteurs de ressources graphiques g&eacute;n&eacute;rant des scripts pour le compilateur de ressources. N'importe quel &eacute;diteur de g&eacute;n&eacute;rant des scripts compatible avec GoRC peut &ecirc;tre utilis&eacute;, comme celui fourni avec <a href="http://fbedit.freebasic.net/index.php">FbEdit</a>. Les &eacute;diteurs de ressources graphiques sont d'une grande aide dans la conception de dialogues et de menus, mais ils vous laissent le soin d'&eacute;crire les proc&eacute;dures fen&ecirc;tres n&eacute;cessaires pour les rendre actifs.<br \>
<br \>
<br \>
</div><a href="#item0">Retour en haut de la page</a><br \>
<br \>
<div class="fb_sect_title">Voir aussi</div><div class="fb_sect_cont"><br \>
<div class="fb_indent"><a href="CompilerFAQ.html">FAQ du compilateur</a>.<br \>
<a href="FaqPgrtlib.html">FAQ de la biblioth&egrave;que d'ex&eacute;cution de FB</a>.<br \>
<br \>
</div></div>
</div>
</div> 
</div> 
</body>
</html>
