<html>
<head>
<title>Screen (Graphics)</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Screen (Graphiques)</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Initialise un mode graphique avec des nombres comme dans QB<br \>
<br \>
<div class="fb_sect_title">Syntaxe</div><div class="fb_sect_cont"><tt><br \>
<b>Screen</b> <i>mode</i> [, [ <i>depth</i> ] [, [ <i>num_pages</i> ] [, [ <i>flags</i> ] [, [ <i>refresh_rate</i> ]]]]]<br \>
 </tt><br \>
</div><div class="fb_sect_title">Param&egrave;tres</div><div class="fb_sect_cont"><br \>
<tt><i>mode</i></tt> <br \>
<div class="fb_indent">est un mode graphique exprim&eacute; par un nombre comme dans QB (voir ci-dessous).  Si <tt><i>mode</i></tt> est <tt>0</tt>, alors tout mode graphique courant est clos, et toutes les fonctions reprennent leurs fonctionnalit&eacute; de mode console.  Voir ci-dessous les modes disponibles.<br \>
</div><tt><i>depth</i></tt><br \>
<div class="fb_indent">est la profondeur de couleur en bits par pixel (bpp).  Ceci n&apos;a d&apos;effet que pour les modes <tt>14</tt> ou sup&eacute;rieurs.  Les valeurs <tt>8</tt>, <tt>16</tt> and <tt>32</tt> sont admises.  <tt>15</tt> et <tt>24</tt> sont admises comme alias respectivement de <tt>16</tt> et <tt>32</tt>.  Si omise, la valeur par d&eacute;faut est <tt>8</tt>.<br \>
</div><tt><i>num_pages</i></tt><br \>
<div class="fb_indent">est le nombre de pages vid&eacute;o que vous d&eacute;sirez, voir ci-dessous.  S&apos;il est omis, &agrave; <tt>1</tt> par d&eacute;faut.<br \>
</div><tt><i>flags</i></tt><br \>
<div class="fb_indent">Sont utilis&eacute;s pour s&eacute;lectionner diff&eacute;rentes choses telles que le driver graphique, le mode plein &eacute;cran. Ce sont des constantes pr&eacute;d&eacute;finies dans le fichier <tt>fbgfx.bi</tt> pr&ecirc;t &agrave; l&apos;usage.  Voir ci-dessous les drapeaux (flags) disponibles. <br \>
</div><tt><i>refresh_rate</i></tt><br \>
<div class="fb_indent">d&eacute;termine une vitesse de rafra&icirc;chissement.  Si ce choix n&apos;est pas possible pour la carte graphique ou si le param&egrave;tre est omis, FreeBASIC choisit automatiquement cette vitesse.<br \>
<br \>
</div></div><div class="fb_sect_title">Description</div><div class="fb_sect_cont"><br \>
<tt><b>Screen</b></tt> indique au compilateur de lier la GfxLib et initialise un mode graphique QB-only, QB-on-GUI ou OpenGL, en fonction du r&eacute;glage de drapeaux <tt><i>flags</i></tt> setting.<br \>
<br \>
Dans les modes de QB-only une fen&ecirc;tre simple ou plein &eacute;cran est activ&eacute;e, un ou plusieurs tampons en m&eacute;moire standard sont cr&eacute;&eacute;s, les commandes de la console sont redirig&eacute;es vers leur version graphique, <a href="GfxDefPalettes.html">une palette par d&eacute;faut</a> est fix&eacute;e et un rafra&icirc;chissement automatique de l&apos;&eacute;cran est d&eacute;marr&eacute;. Les d&eacute;clarations QB-like graphiques et de la console peuvent &ecirc;tre utilis&eacute;es.<br \>
<br \>
En modes QB-on-GUI, un ou plusieurs tampons en m&eacute;moire standard sont cr&eacute;&eacute;s, les commandes de la console sont redirig&eacute;es vers leur version graphique et une <a href="GfxDefPalettes.html">palette par d&eacute;faut</a> est fix&eacute;e.  Les d&eacute;clarations QB-like graphiques et de la console peuvent &ecirc;tre utilis&eacute;es.  C&apos;est &agrave; l&apos;utilisateur de cr&eacute;er une fen&ecirc;tre et de la rafra&icirc;chir avec le contenu des tampons graphiques.<br \>
<br \>
En modes OpenGL, une fen&ecirc;tre simple ou plein &eacute;cran est activ&eacute;e, un ou plusieurs tampons en m&eacute;moire standard sont cr&eacute;&eacute;s, et les librairies OpenGL de l&apos;OS sont initialis&eacute;es.  A partir de l&agrave;, seules les commandes OpenGL sont utilisables; les commandes QB-like et console sont interdites.  Ceci permet d&apos;initialiser OpenGL de façon portable; vous pouvez &eacute;galement utiliser <a href="KeyPgScreencontrol.html">ScreenControl</a> pour personnaliser le format GL de pixel utilis&eacute; avant que <tt><b>Screen</b></tt> soit appel&eacute; ou de r&eacute;cup&eacute;rer la liste des extensions OpenGL permises apr&egrave;s un mode ait &eacute;t&eacute; mis en place, et <a href="KeyPgScreenglproc.html">ScreenGLProc</a> d&apos;obtenir des pointeurs fonction d&apos;extension.<br \>
<br \>
Tout tampon m&eacute;moire qui est cr&eacute;&eacute; dans la m&eacute;moire standard utilise l&apos;un des trois formats pixel internes support&eacute;s, d&eacute;pendant de la profondeur de couleur d&eacute;sir&eacute;e; voir <a href="GfxInternalFormats.html">Formats internes de pixel </a> pour plus de d&eacute;tails.<br \>
<br \>
Si <tt><b>Screen</b></tt> ne peut valider le mode requis, une erreur "Illegal function call" est affich&eacute;e et le pointeur &eacute;cran est mis &agrave; <tt>0</tt>. Ces &eacute;checs de <tt><b>Screen</b></tt> peuvent &ecirc;tre d&eacute;tect&eacute;s en utilisant le processus standard <tt><a href="KeyPgOnerror.html">On Error</a></tt> ou en r&eacute;cup&eacute;rant le pointeur &eacute;cran avec <tt><a href="KeyPgScreenptr.html">ScreenPtr</a></tt>.<br \>
<br \>
Avant de valider un mode plein &eacute;cran le programme doit tester si ce mode est accessible par la carte graphique en utilisant <tt><a href="KeyPgScreenlist.html">ScreenList</a></tt>.<br \>
<br \>
<u>Informations sur le mode</u><br \>
Liste des modes disponibles:<br \>
Compatibilit&eacute; avec les modes QB:<br \>
<div class="fb_table"><table><tr><td>Mode nr</td><td>R&eacute;solution</td><td>Emulation</td><td>Texte</td><td>taille car</td><td>couleurs &agrave; l&apos;&eacute;cran</td></tr><tr><td>1</td><td>320x200</td><td>CGA </td><td>40X25</td><td>8x8</td><td>16 background, 1 of four sets foreground</td></tr><tr><td>2</td><td>640x200</td><td>CGA</td><td>80x25</td><td>8x8</td><td>16 colors to 2 attributes</td></tr><tr><td>7</td><td>320x200</td><td>EGA</td><td>40x25</td><td>8x8</td><td>16 colors to 16 attributes</td></tr><tr><td>8</td><td>640x200</td><td>EGA</td><td>40x25</td><td>8x8</td><td>16 colors to 16 attributes</td></tr><tr><td>9</td><td>640x350</td><td>EGA</td><td>80x25 0r 80x43</td><td>8x14 or 8x8</td><td>16 colors to 16 attributes</td></tr><tr><td>11</td><td>640x480</td><td>VGA</td><td>80x30 or 80x60</td><td>8x16 or 8x8</td><td>256K colors to 2 attributes</td></tr><tr><td>12</td><td>640x480</td><td>VGA</td><td>80x30 or 80x60</td><td>8x16 or 8x8</td><td>256K colors to 16 attributes</td></tr><tr><td>13</td><td>320x200</td><td>MCGA</td><td>40X25</td><td>8X8</td><td>256K colors to 256 attributes</td></tr></table></div><br \>
Nouveaux modes FreeBASIC:<br \>
<div class="fb_table"><table><tr><td>Mode nr</td><td>Resolution</td><td>Emulation</td><td>Text</td><td>char size</td><td>colors on screen</td></tr><tr><td>14</td><td>320x240</td><td>&nbsp;</td><td>40x30</td><td>8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td> 15</td><td>400x300</td><td>&nbsp;</td><td>50x37</td><td>8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td> 16</td><td>512x384</td><td>&nbsp;</td><td>64x24 or 64x48</td><td>8x16 or 8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td>17</td><td>640x400</td><td>&nbsp;</td><td>80x25 or 80x50</td><td>8x16 or 8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td>18</td><td>640x480</td><td>&nbsp;</td><td>80x30 or 80x60</td><td>8x16 or 8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td> 19</td><td>800x600</td><td>&nbsp;</td><td>100x37 or 100x75</td><td>8x16 or 8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td>20</td><td>1024x768</td><td>&nbsp;</td><td>128x48 or 128x96</td><td>8x16 or 8x8</td><td>256K colors to 256 attributes or direct color</td></tr><tr><td> 21</td><td>1280x1024</td><td>&nbsp;</td><td>160x64 or 160x128</td><td>8x16 or 8x8</td><td>256K colors to 256 attributes or direct color</td></tr></table></div> <br \>
<br \>
<u>pr&eacute;cisions sur <tt>depth (profondeur)</tt></u><br \>
Pour les modes <tt>14</tt> et suivants, le param&egrave;tre depth (profondeur) change la profondeur de couleur par celle indiqu&eacute;e; si elle n&apos;est pas sp&eacute;cifi&eacute;e, ces modes fonctionnent en 8bpp.  Pour les modes <tt>13</tt> et avant, <tt><i>depth</i></tt> n&apos;a aucun effet.<br \>
<br \>
<u>pr&eacute;cisions sur <tt>num_pages</tt></u><br \>
    Vous pouvez demander n&apos;importe quel nombre de pages, pour un mode vid&eacute;o; si vous omettez le param&egrave;tre, seule la page visible (num&eacute;ro <tt>0</tt>) sera disponible.  Une page est soit l&apos;&eacute;cran visible ou un tampon hors-&eacute;cran, vous pouvez afficher une page tout en travaillant sur un autre; voir la d&eacute;claration <tt><a href="KeyPgScreenset.html">ScreenSet</a></tt> pour plus de d&eacute;tails.  Toutes les pages sont cr&eacute;&eacute;es dans la m&eacute;moire standard, la m&eacute;moire de la carte vid&eacute;o n&apos;est jamais utilis&eacute;e pour la vid&eacute;o en m&eacute;moire tampon.<br \>
<br \>
<u>pr&eacute;cisions sur <tt>flags</tt>:</u><br \>
<br \>
Si <tt><i>flags</i></tt> est omis, FreeBASIC utilise un mode graphique fen&ecirc;tr&eacute; QB-compatible (sauf sous DOS).  Ces constantes sont d&eacute;finies dans <tt>fbgfx.bi</tt> . Dans le dialecte <i><a href="CompilerOptlang.html">-lang fb</a></i>, ces constantes font partie de <tt>FB</tt> <tt><a href="KeyPgNamespace.html">Namespace</a></tt>. Notez que la plupart des flags ne sont pas support&eacute;s sous DOS.<br \>
<br \>
flags utilisables:<br \>
<br \>
<u>flags mode graphique </u><br \>
<div class="fb_indent"><tt>GFX_NULL</tt>: D&eacute;marre un mode graphique QB-on-GUI.  Il cr&eacute;e un tampon graphique mais pas une fen&ecirc;tre.  L&apos;utilisateur doit r&eacute;aliser la fen&ecirc;tre, le gestionnaire d&apos;&eacute;v&eacute;nements et rafra&icirc;chir l&apos;&eacute;cran quand c&apos;est n&eacute;cessaire.  Ce mode permet de mixer les fonctions graphiques de dessin avec des fen&ecirc;tres "API-driven". Cet indicateur remplace tous les autres indicateurs de mode.  Voir un <a href="SrcPgGfxNull.html">Exemple de GFX_NULL</a> sous Windows.<br \>
<tt>GFX_OPENGL</tt>: Initialise OpenGL pour dessiner dans une simple fen&ecirc;tre. Les fonctions graphiques FreeBasic ne peuvent pas &ecirc;tre utilis&eacute;es.  L&apos;&eacute;cran n&apos;est pas mis &agrave; jour automatiquement, il faut utiliser <tt><a href="KeyPgFlip.html">Flip</a></tt>.  Cette option procure une m&eacute;thode portable pour initialiser la libririe OpenGL.<br \>
Si aucune des options ci-dessus n&apos;est sp&eacute;cifi&eacute;e, FreeBasic passe en mode graphiques QB-only: il cr&eacute;e une m&eacute;moire tampon et une simple fen&ecirc;tre et d&eacute;finit un thread qui met automatiquement &agrave; jour l&apos;&eacute;cran et g&egrave;re le clavier et la souris.  Les fonctions de dessin de FreeBASIC drawing sont accessibles. <br \>
<br \>
</div><u>flags en mode Fen&ecirc;tre</u><br \>
<div class="fb_indent">Les drapeaux du mode Fen&ecirc;tre n&apos;ont aucun sens si mode <tt>GFX_NULL</tt>est utilis&eacute;<br \>
<tt>GFX_WINDOWED</tt>: Si le mode fen&ecirc;tr&eacute; est support&eacute;, FreeBASIC ouvre une fen&ecirc;tre de la taille requise sur le bureau actuel<br \>
<tt>GFX_FULLSCREEN</tt>: Le commutateur de mode graphique carte est commut&eacute; sur le mode demand&eacute; et la profondeur de couleur et le mode OS plein &eacute;cran est utilis&eacute;.  Si ce mode n&apos;est pas utilisable avec la carte pr&eacute;sente FreeBASIC commute le mode fen&ecirc;tr&eacute;.<br \>
Si <tt>GFX_FULLSCREEN</tt> n&apos;est pas pr&eacute;cis&eacute;, le comportement pour <tt>GFX_WINDOWED</tt> est assur&eacute;.<br \>
<tt>GFX_NO_SWITCH</tt>: Emp&ecirc;che l&apos;utilisateur de passer en mode plein &eacute;cran ou en mode fen&ecirc;tr&eacute; en appuyant sur Alt-Enter.<br \>
<tt>GFX_NO_FRAME</tt>: Cr&eacute;e une fen&ecirc;tre sans bord.<br \>
<tt>GFX_SHAPED_WINDOW</tt>: Cr&eacute;e des zones transparentes où RGBA (255, 0, 255, 0) est dessin&eacute; sur l&apos;&eacute;cran.<br \>
<tt>GFX_ALWAYS_ON_TOP</tt>: Cr&eacute;e une fen&ecirc;tre qui reste toujours sur le dessus: donc toujours visible.<br \>
<br \>
</div><u>option drapeaux</u><br \>
<div class="fb_indent">Drapeaux travaillant dans n&apos;importe quel mode, ils activent des comportements sp&eacute;ciaux<br \>
<tt>GFX_ALPHA_PRIMITIVES</tt>: Indique &agrave; la biblioth&egrave;que graphique pour activer le support du canal alpha pour toutes les primitives de dessin. Cela signifie que l&apos;alpha sp&eacute;cifi&eacute; dans une valeur de couleur (via <a href="KeyPgRgba.html">RGBA</a> une macro ou directement une couleur sous la forme &hAARRGGBB) sera toujours utilis&eacute; par toutes les primitives.<br \>
<tt>GFX_HIGH_PRIORITY</tt>: Indique &agrave; la biblioth&egrave;que graphique de permettre une plus grande priorit&eacute; pour les processus graphiques.  A un effet seulement sur les "drivers" <tt>gdi</tt> et <tt>DirectX</tt> d&apos;une plate-forme Win32.<br \>
<br \>
</div><u>drapeaux Tampon OpenGL Buffer</u><br \>
<div class="fb_indent">Ces drapeaux ne fonctionnent qu&apos;en mode graphique OpenGL, ils doivent &ecirc;tre combin&eacute;s avec GFX_OPENGL<br \>
<tt>GFX_STENCIL_BUFFER</tt>: Force OpenGL &agrave; utiliser le Tampon Stencil<br \>
<tt>GFX_ACCUMULATION_BUFFER</tt>: Force OpenGL &agrave; utiliser le Tampon Accumulation<br \>
<tt>GFX_MULTISAMPLE</tt>: Demande plein &eacute;cran anti-aliasing &agrave; travers l&apos;extension ARB_multisample<br \>
<br \>
</div>D&eacute;pendant de la pr&eacute;sence ou non du param&egrave;tre <tt>GFX_FULLSCREEN</tt>, <tt><b>Screen</b></tt> essaiera de valider le mode vid&eacute;o sp&eacute;cifi&eacute; en mode plein &eacute;cran ou fen&ecirc;tr&eacute;, respectivement.  Si le mode plein &eacute;cran est valid&eacute; et que le syst&egrave;me ne peut valider le mode sp&eacute;cifi&eacute; en plein &eacute;cran, il essaiera en mode fen&ecirc;tr&eacute;. Si le mode fen&ecirc;tr&eacute; est valid&eacute; et que le syst&egrave;me ne peut pas ouvrir une fen&ecirc;tre dans le mode sp&eacute;cifi&eacute;, il essaiera en plein &eacute;cran.  Si rien ne fonctionne, <tt><b>Screen</b></tt> n&apos;aura aucun effet et l&apos;ex&eacute;cution reprend &agrave; la d&eacute;claration suivant l&apos;appel &agrave; <tt><b>Screen</b></tt>.  Vous devez prendre soin de v&eacute;rifier si un mode graphique a &eacute;t&eacute; valid&eacute; ou pas, et r&eacute;agir en cons&eacute;quence; une m&eacute;thode pour v&eacute;rifier si <tt><b>Screen</b></tt> a r&eacute;ussi est de tester la valeur retourn&eacute;e du <tt><a href="KeyPgScreenptr.html">ScreenPtr</a></tt> de la fonction; voir sa page pour plus de d&eacute;tails.<br \>
<br \>
<u>Mode graphique console</u><br \>
Les commandes console (<tt><a href="KeyPgLocate.html">Locate</a></tt>, <tt><a href="KeyPgPrint.html">Print</a></tt>), peuvent &ecirc;tre utilis&eacute;es aussi bien avec les modes standard QB <tt><b>Screen</b></tt> qu&apos;avec les extensions, &agrave; condition que la profondeur de couleur standard ne soit pas modifi&eacute;e &agrave; l&apos;aide du second argument de <tt><b>Screen</b></tt>. Lorsque le tableau indique que plusieurs r&eacute;solutions du texte sont disponibles pour le mode texte, la r&eacute;solution de texte demand&eacute;e peut &ecirc;tre obtenue avec <tt><a href="KeyPgWidth.html">Width</a></tt>.  Tous les caract&egrave;res affich&eacute;s par <tt><a href="KeyPgPrint.html">Print</a></tt> effacent l&apos;arriere-plan autour d&apos;eux; pas d&apos;utilisation d&apos;un arriere-plan transparent.<br \>
<br \>
<u>Autres d&eacute;tails</u><br \>
<br \>
En mode fen&ecirc;tr&eacute;, cliquer sur le bouton "fermeture" de la fen&ecirc;tre ajoute un "touche appuy&eacute;e" (keypress) <tt><a href="KeyPgChr.html">Chr</a>(255)&"k"</tt> dans le tampon <tt><a href="KeyPgInkey.html">Inkey</a></tt>.  Cliquer sur le bouton "Maximiser" validera le mode plein &eacute;cran si c&apos;est possible.  Un appel r&eacute;ussi de <tt><b>Screen</b></tt> valide les pages visible et de travail, toutes lesdeux, &agrave; la page num&eacute;ro <tt>0</tt>, r&eacute;initialise la palette &agrave; celle du mode sp&eacute;cifi&eacute; (voir Palettes par d&eacute;faut), r&eacute;initialise la r&eacute;gion de d&eacute;coupage (clipping) &agrave; la taille de l&apos;&eacute;cran, d&eacute;sactive les mappages utilisateur de coordonn&eacute;es, place le curseur graphique au centre de l&apos;&eacute;cran, place le curseur texte dans le coin en haut &agrave; gauche de l&apos;&eacute;cran et et valide les couleurs d&apos;avant-plan et d&apos;arri&egrave;re-plan respectivement vers le blanc brillant et le noir.<br \>
<br \>
</div><div class="fb_sect_title">Exemple</div><div class="fb_sect_cont"><br \>
<tt><div class="freebasic">
<span class="com">&apos;&nbsp;Valide&nbsp;mode&nbsp;ecran&nbsp;13&nbsp;(320*200,&nbsp;8bpp)</span><br />
<span class="key">Screen</span>&nbsp;<span class="num">13</span><br />
<span class="key">Print</span>&nbsp;<span class="quo">"Screen&nbsp;mode&nbsp;13&nbsp;set"</span><br />
<br />
<span class="key">Sleep</span><br />
</div></tt><br />
<br \>
<tt><div class="freebasic">
<span class="def">#include&nbsp;"fbgfx.bi"<br />
#if&nbsp;__FB_LANG__&nbsp;=&nbsp;"fb"<br />
</span><span class="key">Using</span>&nbsp;<span class="wrd">FB</span>&nbsp;<span class="com">&apos;&apos;&nbsp;Drapeaux&nbsp;mode&nbsp;ecran&nbsp;sont&nbsp;dans&nbsp;espace de nom&nbsp;FB&nbsp;en&nbsp;langage&nbsp;FB</span><br />
<span class="def">#endif<br />
</span><br />
<br />
<span class="com">&apos;&nbsp;Valide&nbsp;mode&nbsp;ecran&nbsp;18&nbsp;(640*480)&nbsp;avec&nbsp;profondeur&nbsp;couleur&nbsp;32bpp&nbsp;et&nbsp;4&nbsp;pages,&nbsp;en&nbsp;mode&nbsp;fenetre&nbsp;commutation&nbsp;desactivee</span><br />
<span class="key">Screen</span>&nbsp;<span class="num">18</span><span class="oth">,</span>&nbsp;<span class="num">32</span><span class="oth">,</span>&nbsp;<span class="num">4</span><span class="oth">,</span>&nbsp;<span class="oth">(</span><span class="wrd">GFX_WINDOWED</span>&nbsp;<span class="key">Or</span>&nbsp;<span class="wrd">GFX_NO_SWITCH</span><span class="oth">)</span><br />
<br />
<span class="com">&apos;&nbsp;Verifie&nbsp;que&nbsp;ecran&nbsp;ouvert&nbsp;avec&nbsp;succes</span><br />
<span class="key">If</span>&nbsp;<span class="key">ScreenPtr</span>&nbsp;<span class="oth">=</span>&nbsp;<span class="num">0</span>&nbsp;<span class="key">Then</span><br />
&nbsp;&nbsp;&nbsp;&nbsp;<span class="key">Print</span>&nbsp;<span class="quo">"Error&nbsp;setting&nbsp;video&nbsp;mode!"</span><br />
&nbsp;&nbsp;&nbsp;&nbsp;<span class="key">End</span><br />
<span class="key">End</span>&nbsp;<span class="key">If</span><br />
<br />
<span class="key">Print</span>&nbsp;<span class="quo">"Successfully&nbsp;set&nbsp;video&nbsp;mode"</span><br />
<span class="key">Sleep</span><br />
</div></tt><br />
<br \>
</div><div class="fb_sect_title">Diff&eacute;rences de plates-formes</div><div class="fb_sect_cont"><br \>
<ul><li> En DOS, Fen&ecirc;trage et OpenGL et les interrupteurs connexes ne sont pas disponibles, voir aussi <a href="GfxLib.html">Vue d&apos;ensemble de GfxLib</a><br \>
<br \>
</ul></div><div class="fb_sect_title">Diff&eacute;rences de dialectes</div><div class="fb_sect_cont"><br \>
<ul><li> Dans les dialectes <i><a href="CompilerOptlang.html">-lang fb</a></i> et <i><a href="CompilerOptlang.html">-lang fblite</a></i>, l&apos;usage est:<br \>
</ul><div class="fb_indent"><tt><b>Screen</b> <i>mode</i> [, [ <i>depth</i> ] [, [ <i>num_pages</i> ] [, [ <i>flags</i> ] [, [ <i>refresh_rate</i> ]]]]]</tt><br \>
</div><ul><li> Dans le dialecte <i><a href="CompilerOptlang.html">-lang qb</a></i>, l&apos;usage est:<br \>
</ul><div class="fb_indent"><tt><b>Screen</b> [<i>mode</i>] [,[<i>active_page</i>][,[<i>visible_page</i>]]]</tt><br \>
<br \>
</div></div><div class="fb_sect_title">Diff&eacute;rences avec QB</div><div class="fb_sect_cont"><br \>
<ul><li> Aucune dans le dialecte <i><a href="CompilerOptlang.html">-lang qb</a></i>.<br \>
<li> Dans QB la syntaxe est <tt><b>Screen</b> <i>mode</i>,<i>colormode</i>,<i>active_page</i>,<i>visible_page</i></tt>. De ces param&egrave;tres FreeBASIC supporte seulement <i>mode</i> et red&eacute;finit le rest. L&apos;utilisation de <tt><b>Screen</b> ,,apage,vpage</tt> pour permuter les pages est utilisable seulement dans le dialecte <i><a href="CompilerOptlang.html">-lang qb</a></i>. <br \>
<li> <tt><a href="KeyPgScreenset.html">ScreenSet</a></tt> est utilisable dans les dialectes <i><a href="CompilerOptlang.html">-lang fb</a></i> et <i><a href="CompilerOptlang.html">-lang fblite</a></i>.<br \>
<br \>
</ul></div><div class="fb_sect_title">See also</div><div class="fb_sect_cont"><br \>
<ul><li> <tt><a href="KeyPgScreenCons.html">Screen (Console)</a></tt><br \>
<li> <tt><a href="KeyPgScreenres.html">ScreenRes</a></tt> Alternative plus flexible &agrave; <tt><b>Screen</b></tt><br \>
<li> <tt><a href="KeyPgScreenlist.html">ScreenList</a></tt> Recherche les modes utilisables pour FB GfxLib<br \>
<li> <tt><a href="KeyPgScreencontrol.html">ScreenControl</a></tt> Selection driver et plus <br \>
<li> <tt><a href="KeyPgScreenlock.html">ScreenLock</a></tt><br \>
<li> <tt><a href="KeyPgScreenunlock.html">ScreenUnlock</a></tt><br \>
<li> <tt><a href="KeyPgScreenptr.html">ScreenPtr</a></tt> Acc&egrave;s au niveau "Semi-low"<br \>
<li> <tt><a href="KeyPgScreenset.html">ScreenSet</a></tt><br \>
<li> <tt><a href="KeyPgScreencopy.html">ScreenCopy</a></tt><br \>
<li> <tt><a href="KeyPgScreeninfo.html">ScreenInfo</a></tt><br \>
<li> <tt><a href="KeyPgScreenglproc.html">ScreenGLProc</a></tt><br \>
<li> <tt><a href="GfxInternalFormats.html">Formats internes des pixels</a></tt><br \>
<br \>
</ul></div>
</div>
</div> 
</div> 
</body>
</html>
