<html>
<head>
<title>$Lang</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">$Lang</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	M&eacute;tacommande pour d&eacute;finir le dialecte du compilateur.<br \>
<br \>
<div class="fb_sect_title">Syntaxe</div><div class="fb_sect_cont"><tt><br \>
<b>'$lang:</b> "<i>lang</i>"<br \>
<div class="fb_indent"><i>ou</i><br \>
</div><a href="KeyPgRem.html">Rem</a> <b>$lang:</b> "<i>lang</i>"<br \>
</tt><br \>
</div><div class="fb_sect_title">Param&egrave;tres</div><div class="fb_sect_cont"><br \>
<tt>"<i>lang</i>"</tt><br \>
<div class="fb_indent">Le dialecte &agrave; fixer, entre guillemets, doit &ecirc;tre l'un de ceux-ci: <tt>"fb"</tt>, <tt>"fblite"</tt>, <tt>"qb"</tt>, ou <tt>"deprecated"</tt>.<br \>
<br \>
</div></div><div class="fb_sect_title">Description</div><div class="fb_sect_cont"><br \>
Si l'option <i><a href="CompilerOptforcelang.html">-forcelang</a></i> n'est pas donn&eacute;e sur la ligne de commande, <tt><b>$Lang</b></tt> peut &ecirc;tre utilis&eacute; pour fixer le dialecte du module source dans lequel il apparaît.  Tout au plus deux passes seront effectu&eacute;es sur le module source.  Au premier passage, si le dialecte sp&eacute;cifi&eacute; est est diff&eacute;rent du dialecte par d&eacute;faut (choisi avec <i><a href="CompilerOptlang.html">-lang</a></i>, ou <tt>"fb"</tt> par d&eacute;faut), le compilateur r&eacute;initialisera l'analyseur pour un nouveau passage et red&eacute;marrera la compilation au d&eacute;but du module source.  Si cette m&eacute;tacommande est rencontr&eacute;e &agrave; nouveau lors du second passage, et que le dialecte sp&eacute;cifi&eacute; ne correspond pas au nouveau dialecte courant, un avertissement est &eacute;mis et la compilation continue.  Si des erreurs ont &eacute;t&eacute; rencontr&eacute;es lors du premier passage, le compilateur ne tentera pas une seconde passe.<br \>
<br \>
<tt><b>$Lang</b></tt> ne peut pas &ecirc;tre utilis&eacute; dans toute instruction compos&eacute;e, port&eacute;e ou sous-routine.  Cependant, il peut &ecirc;tre imbriqu&eacute; dans le module niveau pr&eacute;processeur ou utilis&eacute; dans un fichier inclus.<br \>
<br \>
Il n'existe actuellement aucune restriction sur l'endroit o&ugrave; cette directive peut &ecirc;tre plac&eacute;e dans un module source.  &Agrave; l'avenir, cela pourrait changer, la meilleure pratique serait donc d'utiliser cette directive avant la premi&egrave;re d&eacute;claration, d&eacute;finition ou d&eacute;claration ex&eacute;cutable dans la source.<br \>
<br \>
Cette directive remplace l'option <i><a href="CompilerOptlang.html">-lang</a></i>, si elle a &eacute;t&eacute; donn&eacute;e sur la ligne de commande.  Toutefois, si l'option <i><a href="CompilerOptforcelang.html">-forcelang</a></i> a &eacute;t&eacute; donn&eacute;e sur la ligne de commande, cette directive n'aura aucun effet.  Un avertissement est &eacute;mis, la directive est ignor&eacute;e et la compilation va se poursuivre.  Cela permet &agrave; l'utilisateur de remplacer explicitement les m&eacute;tacommandes <tt><b>$Lang</b></tt>.<br \>
<br \>
Cette m&eacute;tacommande a &eacute;t&eacute; introduite dans la version 0.20.0 de FreeBasic. Dans les anciennes versions de FB et QuickBASIC, elle sera trait&eacute;e comme un commentaire et ignor&eacute;e silencieusement .<br \>
<br \>
</div><div class="fb_sect_title">Exemple</div><div class="fb_sect_cont"><br \>
<tt><div class="freebasic">
<span class="com">'$lang:&nbsp;"qb"</span><br />
</div></tt><br />
<br \>
</ul></ul></div><div class="fb_sect_title">Diff&eacute;rences avec QB</div><div class="fb_sect_cont"><br \>
<ul><li> Nouveau pour FreeBASIC<br \>
<li> QB consid&egrave;re <tt>'$lang:</tt> comme un commentaire normal<br \>
<br \>
</ul></div><div class="fb_sect_title">Voir aussi</div><div class="fb_sect_cont"><br \>
<ul><li> <tt><a href="KeyPgPplang.html">#lang</a></tt><br \>
<li> <tt><a href="KeyPgDdfblang.html">__FB_LANG__</a></tt><br \>
<li> <a href="CompilerOptlang.html">Compiler Option: -lang</a><br \>
<li> <a href="CompilerOptforcelang.html">Compiler Option: -forcelang</a><br \>
<li> <a href="CompilerDialects.html">FreeBASIC Dialects</a><br \>
<br \>
</ul></div>
</div>
</div> 
</div> 
</body>
</html>
