<html>
<head>
<title>Header Files (.bi)</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Fichiers d'en-t&ecirc;te (.bi)</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Fournit une interface pour un module.<br \>
<br \>
Un fichier d'en-t&ecirc;te est un type sp&eacute;cial de fichier source qui g&eacute;n&eacute;ralement ne contient que des d&eacute;clarations pr&eacute;-processeur, des d&eacute;finitions, des d&eacute;clarations, des prototypes, des constantes, des &eacute;num&eacute;rations ou des types similaires de d&eacute;clarations; cependant, un fichier d'en-t&ecirc;te peut contenir n'importe quel code source valable si cela est n&eacute;cessaire.  Ce qui les rend diff&eacute;rents des des fichiers source (. bas) , c'est d'&ecirc;tre compil&eacute;s directement, ils sont inclus par un autre fichier source (module ou en-t&ecirc;te) en utilisant la directive <tt><a href="KeyPgInclude.html">#include</a></tt> du pr&eacute;processeur.  Toutes les biblioth&egrave;ques compil&eacute;es ont g&eacute;n&eacute;ralement un (ou plusieurs) fichier(s) en-t&ecirc;te qui peut &ecirc;tre inclus dans un autre fichier source et fera d&eacute;couvrir au compilateur tous les noms des proc&eacute;dures utilisables dans une biblioth&egrave;que particuli&egrave;re.<br \>
<br \>
<div class="fb_sect_title">Fichiers d'en-t&ecirc;te FreeBasic</div><div class="fb_sect_cont"><br \>
Quelques-uns des mots-cl&eacute;s, des constantes et des proc&eacute;dures document&eacute;es dans ce manuel ne sont normalement pas disponibles lors de la compilation d'un code source, sauf si un fichier en-t&ecirc;te sp&eacute;cifique est inclus dans la premi&egrave;re source.<br \>
<ul><li> <tt>datetime.bi</tt><br \>
<li> <tt>dir.bi</tt><br \>
<li> <tt>fbgfx.bi</tt><br \>
<li> <tt>file.bi</tt><br \>
<li> <tt>string.bi</tt><br \>
<li> <tt>vbcompat.bi</tt><br \>
<br \>
</ul></div><div class="fb_sect_title">Sensibilit&eacute; &agrave; la casse</div><div class="fb_sect_cont"><br \>
Bien que la langage FreeBasic lui-m&ecirc;me, ne soit pas sensible &agrave; la casse, le syst&egrave;me de fichiers sur lequel il est ex&eacute;cut&eacute; peut l'&ecirc;tre.  Si un fichier d'en-t&ecirc;te ne peut pas &ecirc;tre trouv&eacute;, v&eacute;rifiez que FreeBasic le recherche au bon endroit et v&eacute;rifiez que les noms du r&eacute;pertoire et du fichier en-t&ecirc;te sp&eacute;cifi&eacute;s dans la d&eacute;claration <tt><a href="KeyPgInclude.html">#include</a></tt> utilise correctement les lettres majuscules et minuscules.<br \>
<br \>
</div><div class="fb_sect_title">S&eacute;parateurs de chemin</div><div class="fb_sect_cont"><br \>
FreeBasic passera automatiquement aux caract&egrave;res barre oblique inverse (\) et barre oblique (/) en fonction de la plate-forme utilis&eacute;e.  Cela permet aux codes source d'&ecirc;tre facilement compatibles entre eux.<br \>
<br \>
</div><div class="fb_sect_title">Inclure une seule fois un fichier en-t&ecirc;te</div><div class="fb_sect_cont"><br \>
Il est fr&eacute;quent que des fichiers d'en-t&ecirc;te doivent <tt><a href="KeyPgInclude.html">#include</a></tt> d'autres fichiers d'en-t&ecirc;te pour &ecirc;tre compil&eacute;s correctement.  FreeBasic propose trois m&eacute;thodes pour se pr&eacute;munir contre l'inclusion multiple d'un fichier d'en-t&ecirc;te.<br \>
<ul><li> <tt><a href="KeyPgPpifndef.html">#ifndef</a></tt>: v&eacute;rifie et limite l'inclusion du fichier d'ent&ecirc;te<br \>
<li> <tt><a href="KeyPgInclude.html">#include</a></tt>: le fichier est inclus <b>une fois</b> dans le fichier o&ugrave; on se trouve<br \>
<li> <tt><a href="KeyPgPragma.html">#pragma</a></tt>: le fichier est inclus <b>une fois</b> dans le fichier d'en-t&ecirc;te lui-m&ecirc;me<br \>
<br \>
</ul></div><div class="fb_sect_title">#ifndef surveille l'inclusion du fichier d'ent&ecirc;te</div><div class="fb_sect_cont"><br \>
L'utilisation de <tt><a href="KeyPgPpifndef.html">#ifndef</a></tt> et <tt><a href="KeyPgPpdefine.html">#define</a></tt> est une pratique courante dans tout langage supportant le tra&icirc;tement du pr&eacute;processeur.  La premi&egrave;re fois qu'un fichier est inclus, un symbole unique est d&eacute;fini.  Lorsque le m&ecirc;me fichier d'en-t&ecirc;te est inclus &agrave; nouveau, la d&eacute;finition du symbole est v&eacute;rifi&eacute;e et si elle est d&eacute;j&agrave; d&eacute;finie, le contenu du fichier d'en-t&ecirc;te est ignor&eacute;.<br \>
<tt><div class="freebasic">
<span class="com">''&nbsp;header.bi</span><br />
<span class="def">#ifndef&nbsp;__HEADER_BI__<br />
#define&nbsp;__HEADER_BI__<br />
</span><br />
<span class="def">#print&nbsp;These&nbsp;statements&nbsp;will&nbsp;only&nbsp;be&nbsp;included&nbsp;once,<br />
#print&nbsp;even&nbsp;though&nbsp;header.bi&nbsp;might&nbsp;be&nbsp;included&nbsp;more&nbsp;<br />
#print&nbsp;than&nbsp;once&nbsp;in&nbsp;the&nbsp;same&nbsp;source&nbsp;file.<br />
</span><br />
<span class="def">#endif<br />
</span></div></tt><br />
<br \>
</div><div class="fb_sect_title">#include une seule fois</div><div class="fb_sect_cont"><br \>
Dans le code source, &agrave; l'endroit o&ugrave; le fichier d'en-t&ecirc;te est inclus, le sp&eacute;cificateur facultatif <tt>"once"</tt> de la directive <tt><a href="KeyPgInclude.html">#include</a></tt> peut indiquer au compilateur de n'inclure qu'une seule fois le fichier source.<br \>
<tt><div class="freebasic">
<span class="com">''&nbsp;header.bi</span><br />
<span class="def">#include&nbsp;once&nbsp;"fbgfx.bi"<br />
</span></div></tt><br />
<tt><div class="freebasic">
<span class="com">''&nbsp;module.bas</span><br />
<span class="def">#include&nbsp;once&nbsp;"fbgfx.bi"<br />
#include&nbsp;once&nbsp;"header.bi"<br />
</span></div></tt><br />
<br \>
</div><div class="fb_sect_title">#pragma une seule fois</div><div class="fb_sect_cont"><br \>
<tt><a href="KeyPgPragma.html">#pragma</a> <b>once</b></tt> peut &ecirc;tre utilis&eacute; pour indiquer que le fichier d'en-t&ecirc;te ne doit &ecirc;tre inclus qu'une seule fois.  <br \>
<tt><div class="freebasic">
<span class="com">''&nbsp;header.bi</span><br />
<span class="def">#pragma&nbsp;once<br />
#print&nbsp;This&nbsp;header&nbsp;will&nbsp;only&nbsp;ever&nbsp;be&nbsp;included&nbsp;once&nbsp;per&nbsp;module<br />
</span></div></tt><br />
<br \>
</div><div class="fb_sect_title">Voir aussi</div><div class="fb_sect_cont"><br \>
<ul><li> <a href="ProPgSourceFiles.html">Les fichiers sources (.bas)</a><br \>
<li> <a href="ExtLibTOC.html">Index des fichiers d'en-t&ecirc;te</a><br \>
<br \>
</ul></div>
</div>
</div> 
</div> 
</body>
</html>
