<html>
<head>
<title>Profiling</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Profilage</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Le profilage peut &ecirc;tre utilis&eacute; pour analyser les performances d'une application.<br \>
<br \>
Les performances d'une application peuvent &ecirc;tre mesur&eacute;es par le nombre de fois que les fonctions sont appel&eacute;es, combien de temps est consacr&eacute; &agrave; l'ex&eacute;cution de ces fonctions et quelles sont les fonctions qui appellent d'autres fonctions. Cela peut aider &agrave; identifier les fonctions susceptibles de prendre trop de temps &agrave; l'ex&eacute;cution ou ex&eacute;cut&eacute;es trop de fois et qui pourraient m&eacute;riter d'&ecirc;tre examin&eacute;es pour une optimisation.<br \>
<br \>
FreeBASIC utilise GPROF pour analyser l'ex&eacute;cution d'une application.  Les informations de profilage sont collect&eacute;es pendant que le programme est en cours d'ex&eacute;cution et GPROF est utilis&eacute; par la suite pour le rapport sur les donn&eacute;es recueillies.<br \>
<br \>
Les trois &eacute;tapes de base pour le profilage d'un programme sont:<br \>
<ul><li> 1) Pr&eacute;parer le programme pour le profilage en compilant le source avec l'option <i><a href="CompilerOptprofile.html">-profile</a></i>.<br \>
<li> 2) Ex&eacute;cuter le programme de collecte d'informations (stock&eacute;es dans <tt>gmon.out</tt>).<br \>
<li> 3) Analyser les informations recueillies &agrave; l'aide de GPROF.<br \>
<br \>
</ul>Une documentation compl&egrave;te sur GPROF est disponible ici: <a href="http://www.gnu.org/software/binutils/manual/gprof-2.9.1/gprof.html">http://www.gnu.org/software/binutils/manual/gprof-2.9.1/gprof.html</a>.  Si la documentation s'est d&eacute;plac&eacute;e de cet endroit, il suffit de rechercher sur le web pour "GNU GPROF" et un lien pertinent devrait &ecirc;tre retourn&eacute;.<br \>
<br \>
FreeBASIC prend en charge le profilage des fonctions; pas de profilage bloc-de-base et ligne-par-ligne.<br \>
<br \>
<div class="fb_sect_title">Pr&eacute;parer un programme pour le profilage</div><div class="fb_sect_cont"><br \>
Seul le code qui est compil&eacute; avec l'option de ligne de commande <i><a href="CompilerOptprofile.html">-profile</a></i> peut &ecirc;tre profil&eacute;.  Passer l'option <i><a href="CompilerOptprofile.html">-profile</a></i> pour le compilateur FreeBASIC pour pr&eacute;parer le programme au profilage.  Ceci indique au compilateur d'ins&eacute;rer du code de d&eacute;marrage sp&eacute;cial au d&eacute;but de l'application ainsi qu'au d&eacute;but de chaque fonction.<br \>
<pre class="fb_pre">
fbc program.bas -profile
</pre><br \>
</div><div class="fb_sect_title">Le profilage du programme</div><div class="fb_sect_cont"><br \>
Les informations n&eacute;cessaires pour analyser l'ex&eacute;cution du programme sont recueillies lorsque le programme est en cours d'ex&eacute;cution.  Ex&eacute;cutez le programme pour commencer &agrave; collecter les informations d'appel de fonctions.  Ces informations sont automatiquement stock&eacute;es dans un fichier nomm&eacute; <tt>gmon.out</tt> dans le m&ecirc;me r&eacute;pertoire que le programme.<br \>
<br \>
</div><div class="fb_sect_title">Analyse des r&eacute;sultats du programme</div><div class="fb_sect_cont"><br \>
Utiliser GPROF pour analyser les r&eacute;sultats.  Le rapport par d&eacute;faut de GPROF inclut des descriptions de ce que signifie chacune des colonnes de valeurs.  Si vous &ecirc;tes nouvel utilisateur de GPROF, vous pouvez d'abord ex&eacute;cuter le rapport par d&eacute;faut et lire les descriptions.  La sortie de GPROF peut &ecirc;tre sauvegard&eacute;e dans un fichier de redirection.<br \>
<br \>
Enregistrer la sortie de GPROF dans <tt>profile.txt</tt>:<br \>
<pre class="fb_pre">
gprof program[.exe] > profile.txt
</pre><br \>
Afficher uniquement le rapport simple sans les descriptions:<br \>
<pre class="fb_pre">
gprof program[.exe] --brief --flat-profile > profile.txt
</pre><br \>
</div><div class="fb_sect_title">Combiner les r&eacute;sultats de plusieurs sessions</div><div class="fb_sect_cont"><br \>
GPROF a aussi une option '--sum' pour combiner commod&eacute;ment les r&eacute;sultats de plusieurs sessions d'ex&eacute;cutions.  Voici un exemple utilisable:<br \>
<ul><li> Ex&eacute;cutez votre programme une fois. Cela cr&eacute;era <tt>gmon.out</tt>.<br \>
<li> Utilisez la commande:<br \>
</ul><div class="fb_indent"><tt>mv gmon.out gmon.sum</tt> <br \>
ou <br \>
<tt>rename gmon.out gmon.sum</tt>.<br \>
</div><ul><li> Ex&eacute;cutez &agrave; nouveau votre programme.  Cela cr&eacute;era de nouvelles donn&eacute;es dans <tt>gmon.out</tt>.<br \>
<li> Fusionnez les nouvelles donn&eacute;es dans <tt>gmon.out</tt> dans <tt>gmon.sum</tt> en utilisant la commande: <br \>
</ul><div class="fb_indent"><tt>gprof --sum program[.exe] gmon.out gmon.sum</tt><br \>
</div><ul><li> R&eacute;p&eacute;tez les deux derni&egrave;res &eacute;tapes autant de fois que n&eacute;cessaire. <br \>
<li> Analysez les donn&eacute;es de synth&egrave;se &agrave; l'aide de la commande: <br \>
</ul><div class="fb_indent"><tt>gprof program[.exe] gmon.sum &gt; profile.txt</tt><br \>
<br \>
</div></div><div class="fb_sect_title">Fonctionnement interne du profilage FreeBASIC</div><div class="fb_sect_cont"><br \>
Quand l'option '-profile' est valid&eacute;e, un ou plusieurs morceaux de code sont ajout&eacute;s au programme.<br \>
<ul><li> L'appel &agrave; <tt>"_monstartup()"</tt> au d&eacute;but du code principal implicite initialise la biblioth&egrave;que de profilage.<br \>
<li> Un appel &agrave; <tt>"mcount()"</tt> au d&eacute;but de chaque proc&eacute;dure.  C'est ainsi que la biblioth&egrave;que de profilage garde la trace de ce que fait la fonction en cours et aussi les autres fonctions.<br \>
<li> Lier du code de programmation suppl&eacute;mentaire de d&eacute;marrage.  (par exemple, <tt>gcrt?.o</tt> )<br \>
<br \>
</ul>La biblioth&egrave;que de profilage peut &ecirc;tre elle-m&ecirc;me dans une biblioth&egrave;que s&eacute;par&eacute;e ou &ecirc;tre une partie de la biblioth&egrave;que d'ex&eacute;cution C.<br \>
<ul><li> mingw n&eacute;cessitera <tt>gcrt2.o</tt> et <tt>libgmon.a </tt><br \>
<li> cygwin n&eacute;cessitera gcrt0.o et <tt>libgmon.a</tt><br \>
<li> dos n&eacute;cessitera <tt>gcrt0.o</tt> (le code de profilage est dans <tt>libc.a</tt>) <br \>
<li> linux n&eacute;cessitera <tt>gcrt1.o</tt> (le code de profilage est dans <tt>libc.a</tt>) <br \>
<br \>
</ul>Les d&eacute;tails peuvent varier d'un portage de FreeBasic &agrave; l'autre, mais le code source construit pour le profilage avec FreeBasic devrait &ecirc;tre compatible avec d'autres langages qui supportent GPROF.<br \>
<br \>
</div>
</div>
</div> 
</div> 
</body>
</html>
