<html>
<head>
<title>Control Flow Statements</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Instructions de contr&ocirc;le de flux</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Des instructions qui dirigent le flux d'ex&eacute;cution.<br \>
<br \>
<div class="fb_sect_title">Description</div><div class="fb_sect_cont"><br \>
Les instructions de contr&ocirc;le de flux contr&ocirc;lent l'ex&eacute;cution du programme d'une instruction &agrave; la suivante;  elles d&eacute;terminent quelles d&eacute;clarations sont ex&eacute;cut&eacute;es et quand, en se basant sur une certaine condition. La condition est toujours une expression qui renvoie vrai = true ou faux = false. La plupart des instructions de contr&ocirc;le de flux v&eacute;rifient un certain genre de condition et dirigent le flux du code en fonction, c'est &agrave; dire qu'elles ex&eacute;cutent ou non un bloc de code (&agrave; l'exception des instructions de transfert d'ex&eacute;cution de flux et <tt><a href="KeyPgDoloop.html">Do..Loop</a></tt>, qui a une condition facultative). En outre, toutes les instructions de contr&ocirc;le de flux peuvent &ecirc;tre imbriqu&eacute;es, c'est &agrave; dire qu'elles peuvent avoir d'autres instructions de contr&ocirc;le de flux &agrave; l'int&eacute;rieur de leur propre bloc d'instructions.<br \>
<br \>
Les instructions de contr&ocirc;le de flux se d&eacute;clinent de trois mani&egrave;res: transfert, branchement et boucle. Les instructions de transfert de contr&ocirc;le de flux transf&egrave;rent l'ex&eacute;cution &agrave; des parties du code diff&eacute;rentes. Les instructions de contr&ocirc;le de branchement du flux ex&eacute;cutent un certain bloc d'instructions en se basant sur une condition, alors que les instructions de contr&ocirc;le de boucle ex&eacute;cuter du code &agrave; plusieurs reprises tant que/jusqu'&agrave; ce qu'une condition soit remplie.<br \>
<br \>
</div><div class="fb_sect_title">Instructions de transfert d'ex&eacute;cution de flux</div><div class="fb_sect_cont"><br \>
Ces instructions sont utilis&eacute;es pour le transfert inconditionnel ou conditionnel, temporaire ou d&eacute;finitif de l'ex&eacute;cution. Les variantes avec "ON" s&eacute;lectionnent conditionnellement un point de transfert dans une liste d'&eacute;tiquettes texte.  L'ex&eacute;cution peut &ecirc;tre transf&eacute;r&eacute;e entre diff&eacute;rents champs d'application &agrave; condition que le branchement ne traverse aucune d&eacute;finition de tableau local, de cha&icirc;ne de longueur variable ou d'objet.<br \>
<br \>
<b><a href="KeyPgGoto.html">Goto</a></b><br \>
<div class="fb_indent">Transf&egrave;re sans condition l'ex&eacute;cution &agrave; un autre point du code d&eacute;fini par un label texte. L'ex&eacute;cution reprend &agrave; la premi&egrave;re instruction suivant cette &eacute;tiquette.<br \>
<br \>
</div><b><a href="KeyPgGosub.html">GoSub</a></b><br \>
<div class="fb_indent">Transf&egrave;re sans condition et temporairement l'ex&eacute;cution &agrave; un autre point du code d&eacute;fini par un label texte. L'ex&eacute;cution reprend &agrave; la premi&egrave;re d&eacute;claration apr&egrave;s cette &eacute;tiquette. L'ex&eacute;cution est alors ramen&eacute;e &agrave; son emplacement d'origine avec le mot-cl&eacute; <tt><a href="KeyPgReturn.html">Return</a></tt>. Oui, des d&eacute;clarations <tt><a href="KeyPgGosub.html">GoSub</a></tt> peuvent &ecirc;tre imbriqu&eacute;es, ce qui signifie que plusieurs d&eacute;clarations <tt><a href="KeyPgGosub.html">GoSub</a></tt> peuvent &ecirc;tre ex&eacute;cut&eacute;es le premier <tt><a href="KeyPgReturn.html">Return</a></tt> correspondant, mais il doit toujours y avoir un <tt><a href="KeyPgReturn.html">Return</a></tt> correspondant dans le d&eacute;roulement de l'application.<br \>
<br \>
</div><b><a href="KeyPgOngoto.html">On Goto</a></b><br \>
<div class="fb_indent">Transf&egrave;re l'ex&eacute;cution vers un point d'une s&eacute;rie de points du code d&eacute;finis par des labels texte, en se basant sur la valeur d'une expression.<br \>
<br \>
</div><b><a href="KeyPgOngosub.html">On Gosub</a></b><br \>
<div class="fb_indent">Transf&egrave;re temporairement l'ex&eacute;cution vers un point d'une s&eacute;rie de points du code d&eacute;finis par des labels texte, en se basant sur la valeur d'une expression.<br \>
<br \>
</div></div><div class="fb_sect_title">Instructions de branchement</div><div class="fb_sect_cont"><br \>
Ces instructions sont utilis&eacute;es pour ex&eacute;cuter un bloc d'un certain nombre de blocs d'instructions.<br \>
<br \>
<b><a href="KeyPgIfthen.html">If..End If</a></b><br \>
<div class="fb_indent">Ex&eacute;cute un bloc d'instructions si une expression est &eacute;valu&eacute;e comme "true" = vrai (la condition). Si et seulement si l'expression est &eacute;valu&eacute;e &agrave; "false" = faux, un autre bloc d'instructions peut &ecirc;tre ex&eacute;cut&eacute; si une autre expression est &eacute;valu&eacute;e &agrave; "true" = vrai en utilisant le mot-cl&eacute; <tt><a href="KeyPgElseif.html">ElseIf</a></tt>. Si et seulement si toutes ces expressions sont &eacute;valu&eacute;es &agrave; faux, un bloc d'instructions peut &ecirc;tre ex&eacute;cut&eacute; en utilisant le mot-cl&eacute; <tt><a href="KeyPgElse.html">Else</a></tt>.<br \>
<br \>
</div><b><a href="KeyPgSelectcase.html">Select..End Select</a></b><br \>
<div class="fb_indent">Ex&eacute;cute un bloc d'une s&eacute;rie de blocs d'instructions. Cette instruction de branchement tente de r&eacute;pondre &agrave; une condition par rapport &agrave; une expression en choisissant un cas parmi un certain nombre de cas possibles relatifs &agrave; cette expression. Les diff&eacute;rents cas sont v&eacute;rifi&eacute;s dans l'ordre dans lequel ils sont donn&eacute;s et le premier cas qui correspondra (vrai) forcera l'ex&eacute;cution du bloc d'instructions correspondant. Comme pour <tt><a href="KeyPgIfthen.html">If..End If</a></tt>, un cas par d&eacute;faut peut &ecirc;tre d&eacute;fini quand aucun des cas d&eacute;finis ne correspond &agrave; la condition, et, comme avec les instructions de contr&ocirc;le de boucle, on peut sortir pr&eacute;matur&eacute;ment d'un bloc d'instructions de v&eacute;rification de cas avec le mot-cl&eacute; <tt><a href="KeyPgExit.html">Exit</a></tt>.<br \>
<br \>
</div></div><div class="fb_sect_title">Instructions de bouclage</div><div class="fb_sect_cont"><br \>
Ces d&eacute;clarations sont utilis&eacute;es pour l'ex&eacute;cution d'un bloc d'instructions &agrave; plusieurs reprises. Dans un bloc d'instructions, la boucle peut &ecirc;tre pr&eacute;matur&eacute;ment r&eacute;ex&eacute;cut&eacute;e en utilisant le mot-cl&eacute; <tt><a href="KeyPgContinue.html">Continue</a></tt> ou abandonn&eacute; en utilisant le mot-cl&eacute; <tt><a href="KeyPgExit.html">Exit</a></tt>. Que la boucle se termine par la condition ou avec le mot-cl&eacute; <tt><a href="KeyPgExit.html">Exit</a></tt>, l'ex&eacute;cution commence toujours &agrave; la premi&egrave;re instruction apr&egrave;s le bloc.<br \>
<br \>
<b><a href="KeyPgWhilewend.html">While..Wend</a></b><br \>
<div class="fb_indent">Ex&eacute;cute un bloc d'instructions tant qu'une expression est &eacute;valu&eacute;e &agrave; "true" = vrai (la condition). L'expression est &eacute;valu&eacute;e et v&eacute;rifi&eacute;e avant que le bloc d'instructions ne soit ex&eacute;cut&eacute;.<br \>
<br \>
</div><b><a href="KeyPgFornext.html">For..Next</a></b><br \>
<div class="fb_indent">Comme <tt><a href="KeyPgWhilewend.html">While..Wend</a></tt>, mais plus adapt&eacute; pour boucler un certain nombre fois. Cette boucle initialise un it&eacute;rateur avec une valeur initiale qui est compar&eacute;e &agrave; une expression de test. Si la comparaison de l'it&eacute;rateur donne un r&eacute;sultat inf&eacute;rieur ou &eacute;gal &agrave; l'expression de test (la condition), le bloc d'instructions est ex&eacute;cut&eacute; et l'it&eacute;rateur est alors incr&eacute;ment&eacute;. La boucle peut &eacute;galement &ecirc;tre configur&eacute;e de telle sorte que l'it&eacute;rateur soit d&eacute;cr&eacute;ment&eacute; apr&egrave;s chaque boucle, auquel cas il est compar&eacute; si sup&eacute;rieur ou &eacute;gal &agrave; l'expression de test. Les it&eacute;rateurs peuvent &ecirc;tre des types de donn&eacute;es num&eacute;riques comme <tt><a href="KeyPgInteger.html">Integer</a></tt> ou <tt><a href="KeyPgSingle.html">Double</a></tt>, ou des types d&eacute;finis par l'utilisateur. Types d&eacute;finis par l'utilisateur doivent mettre en oeuvre l'<tt><a href="KeyPgOpFor.html">Op&eacute;rateur For</a></tt>.<br \>
</div><b><a href="KeyPgDoloop.html">Do..Loop</a></b><br \>
<div class="fb_indent">La plus polyvalente des instructions de bouclage, cette boucle peut ex&eacute;cuter un bloc d'instructions tant que/jusqu'&agrave; ce que l'expression soit &eacute;valu&eacute;e &agrave; "true" = vrai (la condition). Elle peut aussi retarder le contr&ocirc;le de l'expression jusqu'&agrave; ce que le bloc soit ex&eacute;cut&eacute; une premi&egrave;re fois, utile quand un bloc d'instructions doit &ecirc;tre ex&eacute;cut&eacute; <i>au moins une fois</i>. Enfin, cette boucle peut n'avoir aucune condition et simplement boucler ind&eacute;finiment.<br \>
<br \>
</div></div>
</div>
</div> 
</div> 
</body>
</html>
