<html>
<head>
<title>Variable and Procedure Linkage</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Linkage (Liens) des variables et proc&eacute;dures</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Visibilit&eacute; des noms &agrave; l'int&eacute;rieur et entre les modules<br \>
<br \>
<i>Linkage (Liens)</i> fait r&eacute;f&eacute;rence &agrave; la visibilit&eacute; du nom d'une variable, d'un objet ou d'une proc&eacute;dure entre un ou plusieurs modules d'un programme. In other words, a linkage dictates how a name is shared between modules. Il existe deux principaux types de liaison d'un nom: <i>internal (interne)</i> et <i>external (externe)</i>.<br \>
<br \>
<div class="fb_sect_title">Internal linkage (Liaison interne)</div><div class="fb_sect_cont"><br \>
<br \>
Les noms avec "<i>internal linkage</i>" (liaison interne) font seulement r&eacute;f&eacute;rence &agrave; des variables, des objets ou des proc&eacute;dures d&eacute;finis au sein de leur propre module; ils ne sont pas visibles de l'ext&eacute;rieur par d'autres modules. Cela signifie que deux ou plusieurs modules peuvent se r&eacute;f&eacute;rer &agrave; des choses diff&eacute;rentes en utilisant le m&ecirc;me nom. Notez que "linkage (Liens)" se r&eacute;f&egrave;re uniquement &agrave; la visibilit&eacute; d'un nom, et selon sa classe de stockage et sa dur&eacute;e de vie, une variable, un objet ou une proc&eacute;dure avec "<i>internal linkage</i>" (liaison interne) peut &ecirc;tre partag&eacute; entre les modules en utilisant son adresse.<br \>
<br \>
<div class="fb_sect_title">D&eacute;clarations de port&eacute;e module</div><br \>
<br \>
<div class="fb_indent">Les noms de variables et d'objets d&eacute;clar&eacute;s au niveau de port&eacute;e-module ont un "<i>internal linkage</i>" (liaison interne) sauf s'ils sont d&eacute;clar&eacute;s avec <tt><a href="KeyPgExtern.html">Extern</a></tt> ou <tt><a href="KeyPgCommon.html">Common</a></tt>. Par exemple, les noms de variables d&eacute;clar&eacute;s la premi&egrave;re fois avec <tt><a href="KeyPgDim.html">Dim</a></tt> ou <tt><a href="KeyPgStatic.html">Static</a></tt> ont un "<i>internal linkage</i>" (liaison interne) et ces variables peuvent seulement &ecirc;tre d&eacute;sign&eacute;es par leur nom dans le module dans lequel elles sont d&eacute;finies. Notez que l'utilisation de <tt><a href="KeyPgShared.html">Shared</a></tt> ne permet que la visibilit&eacute; de nom dans les proc&eacute;dures du module et ne contribue pas &agrave; la liaison de nom.<br \>
<br \>
Les noms de proc&eacute;dure d&eacute;clar&eacute;es avec <tt><a href="KeyPgPrivate.html">Private</a></tt> ont un "<i>internal linkage</i>" (liaison interne).<br \>
<br \>
</div><div class="fb_sect_title">D&eacute;clarations de port&eacute;e locale</div><br \>
<br \>
<div class="fb_indent">Tous les noms de variables et d'objets d&eacute;clar&eacute;s de port&eacute;e locale (dans une boucle <tt><a href="KeyPgDo.html">Do</a></tt> ou dans le corps d'une proc&eacute;dure, par exemple) ont un "<i>internal linkage</i>" (liaison interne).<br \>
<br \>
</div></div><div class="fb_sect_title">External linkage (Liaison externe)</div><div class="fb_sect_cont"><br \>
<br \>
Les noms avec un "<i>external linkage</i>" (liaison externe) peuvent faire r&eacute;f&eacute;rence &agrave; des variables, des objets ou des proc&eacute;dures d&eacute;finis au sein de leur propre module ou dans un autre module. Avoir un "<i>external linkage</i>" (liaison externe) signifie que le nom est visible vers l'ext&eacute;rieur &agrave; d'autres moduleset tous les modules qui utilisent ce m&ecirc;me nom externe se r&eacute;f&egrave;rent tous &agrave; la m&ecirc;me variable, au m&ecirc;me objet ou &agrave; la m&ecirc;me proc&eacute;dure. Ainsi, un seul module peut d&eacute;finir un nom externe (le compilateur se plaindra d'une d&eacute;finition en double s'il constate une d&eacute;finition suppl&eacute;mentaire d'un nom avec "<i>external linkage</i>" (liaison externe)).<br \>
<br \>
<div class="fb_sect_title">D&eacute;clarations de port&eacute;e module</div><br \>
<br \>
<div class="fb_indent">Les noms de variables et d'objets d&eacute;clar&eacute;s au niveau de port&eacute;e-module pour avoir un "<i>external linkage</i>" (liaison externe) sont d&eacute;clar&eacute;es avec <tt><a href="KeyPgExtern.html">Extern</a></tt> ou <tt><a href="KeyPgCommon.html">Common</a></tt>. <br \>
<br \>
<tt><a href="KeyPgExtern.html">Extern</a></tt> d&eacute;clare que la variable a un "<i>external linkage</i>" (liaison externe), mais ne la d&eacute;finit pas.  Cette d&eacute;claration externe doit passer avant toute d&eacute;finition du m&ecirc;me nom (une d&eacute;claration sans <tt><a href="KeyPgExtern.html">Extern</a></tt> sp&eacute;cifie un "<i>internal linkage</i>" (liaison interne), et actuellement, les d&eacute;clarations ult&eacute;rieures externes de ce nom signifient une d&eacute;finition double).  Les noms de variables et d'objets avec "<i>external linkage</i>" (liaison externe) d&eacute;clar&eacute;s &agrave; l'aide de <tt><a href="KeyPgExtern.html">Extern</a></tt> sont toujours dans la port&eacute;e partag&eacute;e (shared scope), et on peut donc se r&eacute;f&eacute;rer &agrave; eux dans les corps de proc&eacute;dure.<br \>
<br \>
<tt><a href="KeyPgCommon.html">Common</a></tt> d&eacute;clare que la variable a un "<i>external linkage</i>" (liaison externe) ainsi qu'il d&eacute;finit la variable.  Mais, il est diff&eacute;rent de <tt><a href="KeyPgExtern.html">Extern</a></tt> par le fait que la d&eacute;finition <tt><a href="KeyPgCommon.html">Common</a></tt>  de la variable peut apparaître dans plus d'un module.  Lorsqu'il est utilis&eacute; avec des tableaux, seuls des tableaux de longueur variable, sans indices peuvent &ecirc;tre d&eacute;clar&eacute;s, et le tableau doit &ecirc;tre dimensionn&eacute; de moment de l'ex&eacute;cution &agrave; l'aide de <tt><a href="KeyPgDim.html">Dim</a></tt> ou <tt><a href="KeyPgRedim.html">ReDim</a></tt> avant qu'il puisse &ecirc;tre utilis&eacute;.  Les noms de variables et d'objets avec un "<i>external linkage</i>" (liaison externe) d&eacute;clar&eacute;s &agrave; l'aide de <tt><a href="KeyPgCommon.html">Common</a></tt> ne sont que dans la port&eacute;e partag&eacute;e si le sp&eacute;cificateur de port&eacute;e <tt><a href="KeyPgShared.html">Shared</a></tt> est aussi utilis&eacute;.  On peut se r&eacute;f&eacute;rer aux variables partag&eacute;es dans les corps de proc&eacute;dures.<br \>
<br \>
Quand <tt><a href="KeyPgExtern.html">Extern</a></tt> et <tt><a href="KeyPgCommon.html">Common</a></tt> sont utilis&eacute;s les deux ensemble pour d&eacute;clarer et d&eacute;finir une variable, l'effet est que le sens de la d&eacute;claration <tt><a href="KeyPgCommon.html">Common</a></tt> est modifi&eacute; de façon &agrave; se comporter comme s'il s'agissait d'une d&eacute;claration <tt><a href="KeyPgDim.html">Dim</a></tt>.  Il est donc g&eacute;n&eacute;ralement pas recommand&eacute; de m&eacute;langer <tt><a href="KeyPgExtern.html">Extern</a></tt> et <tt><a href="KeyPgCommon.html">Common</a></tt> sur la m&ecirc;me variable dans le m&ecirc;me module.  Toutefois, les variables peuvent &ecirc;tre d&eacute;clar&eacute;es et d&eacute;finies avec <tt><a href="KeyPgCommon.html">Common</a></tt> dans un module et puis r&eacute;f&eacute;renc&eacute;es avec <tt><a href="KeyPgExtern.html">Extern</a></tt> dans un autre module, sans confusion.<br \>
<br \>
Les noms de proc&eacute;dure sont d&eacute;clar&eacute;s comme ayant un "<i>external linkage</i>" (liaison externe) par d&eacute;faut. Les d&eacute;clarations utilisant explicitement <tt><a href="KeyPgPublic.html">Public</a></tt> signifient "<i>external linkage</i>" (liaison externe).<br \>
<br \>
</div><div class="fb_sect_title">Les d&eacute;clarations de port&eacute;e locale</div><br \>
<br \>
<div class="fb_indent">Actuellement, les noms d&eacute;clar&eacute;s de port&eacute;e locale ne peuvent pas avoir un "<i>external linkage</i>" (liaison externe).<br \>
<br \>
</div><br \>
   <br \>
</div>
</div>
</div> 
</div> 
</body>
</html>
