<html>
<head>
<title>Microsoft QuickBASIC</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Microsoft QuickBASIC</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Un compilateur, interpr&eacute;teur et IDE BASIC<br \>
<br \>
QuickBASIC est un interpr&eacute;teur / compilateur de vingt ans qui a servi de mod&egrave;le pour FreeBASIC. Il fonctionne sous 16-bit MS-DOS.<br \>
<br \>
Plus d'information sur <a href="http://en.wikipedia.org">Wikipedia</a>:<br \>
<br \>
Microsoft QuickBASIC (souvent abr&eacute;g&eacute;, correctement, QB, ou de fa&ccedil;on erron&eacute;e, "QBasic", qui est un syst&egrave;me diff&eacute;rent) est un descendant du langage de programmation BASIC qui a &eacute;t&eacute; d&eacute;velopp&eacute; par la soci&eacute;t&eacute; Microsoft pour une utilisation avec le syst&egrave;me d'exploitation MS-DOS.  Il &eacute;tait vaguement bas&eacute; sur GW-BASIC mais en outre fournissait des types d&eacute;finis par l'utilisateur, des structures de programmation am&eacute;lior&eacute;es, de meilleurs graphismes et de support de disque et un compilateur en plus de l'interpr&egrave;teur. Microsoft a vendu QuickBASIC comme une suite de d&eacute;veloppement commercial.<br \>
<br \>
Microsoft a publi&eacute; la premi&egrave;re version de QuickBASIC le 18 ao&ucirc;t 1985 stock&eacute;e sur une seule disquette 5,25". QuickBASIC est apparu avec un environnement de conception int&eacute;gr&eacute; (IDE) nettement diff&eacute;rent de celui qui &eacute;tait fourni avec les versions pr&eacute;c&eacute;dentes. Les num&eacute;ros de ligne n'&eacute;taient plus n&eacute;cessaires et les utilisateurs pouvaient ins&eacute;rer et supprimer des lignes directement via un &eacute;diteur de texte &agrave; l'&eacute;cran.<br \>
<br \>
Le compilateur Microsoft "PC BASIC" &eacute;tait inclus et compilait les programmes en ex&eacute;cutables DOS. L'&eacute;diteur avait &eacute;galement un interpr&egrave;teur interne permettant l'ex&eacute;cution du programme sans quitter l'&eacute;diteur et qui pouvait &ecirc;tre utilis&eacute; pour d&eacute;boguer le programme avant de cr&eacute;er un fichier ex&eacute;cutable. Malheureusement, il y avait quelques petites diff&eacute;rences subtiles entre l'interpr&egrave;teur et le compilateur, de sorte que parfois, les programmes ex&eacute;cut&eacute;s parfaitement dans l'interpr&eacute;teur &eacute;chouaient apr&egrave;s la compilation ou ne se compilaient m&ecirc;me pas du tout.<br \>
<br \>
La derni&egrave;re version de QuickBASIC fut la 4.5 (1988) m&ecirc;me s'il y avait poursuite du d&eacute;veloppement du Microsoft Basic Professional Development System (PDS), dont la derni&egrave;re version a &eacute;t&eacute; la 7.1 (June 1990). La version PDS de l'IDE a &eacute;t&eacute; appel&eacute;e QuickBASIC Extended (QBX). Le successeur de QuickBASIC et PDS fut Visual Basic pour MSDOS 1.0 produit dans les versions Standard et Professionnelle. Les versions ult&eacute;rieures de Visual Basic ne comprenaient pas les versions DOS car Microsoft voulait que les d&eacute;veloppeurs se concentrent sur les applications Windows.<br \>
<br \>
Un remplacement pour GW-BASIC, bas&eacute; sur QuickBASIC 4.5 a &eacute;t&eacute; inclus avec MS-DOS 5 et ses versions ult&eacute;rieures. On l'appela QBASIC. Compar&eacute; &agrave; QuickBASIC, il est limit&eacute; car il manque quelques fonctions, ne peut g&eacute;rer que des programmes d'une taille limit&eacute;e, manque de support des modules s&eacute;par&eacute;s et c'est un seulement un interpr&egrave;teur. Il ne peut pas &ecirc;tre utilis&eacute; pour produire des fichiers ex&eacute;cutables directement, bien que les programmes &eacute;labor&eacute;s puissent encore &ecirc;tre compil&eacute;s par un compilateur QuickBASIC 4.5, 7.1 ou PDS VBDOS 1.0, si vous poss&eacute;dez l'un des deux.<br \>
<br \>
Pour en savoir plus sur le langage, l'histoire et la communaut&eacute; de QuickBASIC et son interpr&egrave;teur libre, allez voir le <a href="http://en.wikipedia.org/wiki/QBasic">Wikipedia QBasic</a>. Il y a plus de liens et d'informations, y compris un tutoriel "barebones" pour la programmation rapide QBasic.<br \>
<br \>
<b>Liens externes</b><br \>
<div class="fb_indent"> <a href="http://www.petesqbsite.com/">Pete's QB Site</a>. Un des plus anciens sites QB restant (depuis oct. 1998).<br \>
 <a href="http://www.qbasicnews.com/">QQN/QBN: QBasic/QuickBasic News</a>.<br \>
 <a href="http://www.qbasicnews.com/sections.php?id=4">QQN's Newbies Section</a> qui inclut un lien pour t&eacute;l&eacute;charger QBasic.</div>
</div>
</div> 
</div> 
</body>
</html>
