<html>
<head>
<title>SDL_Net: Getting Started</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">SDL_Net: Mise en route</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	<br \>
<div class="fb_indent">Un guide complet &eacute;tape par &eacute;tape de "hello world" &agrave; "hello world" via une connexion TCP/IP, en utilisant la biblioth&egrave;que SDL SDL_net.Ce tutoriel va lister tous composants n&eacute;cessaires et o&ugrave; les t&eacute;l&eacute;charger au moment de la r&eacute;daction suivie de la fa&ccedil;on d'obtenir de chaque composant: &agrave; l'endroit appropri&eacute; pour ex&eacute;cuter les fonctions propres et, enfin, comment &eacute;crire le code. Je vais supposer que vous avez z&eacute;ro connaissance ant&eacute;rieure et de ce fait certains lecteurs peuvent vouloir sauter les premi&egrave;res lignes de ce tutoriel.<br \>
</div><i>Ecrit par GregF (Paragon)</i><br \>
<br \>
<div class="fb_header">Etape 1: Ce qui est n&eacute;cessaire.</div><br \>
<div class="fb_indent">Ok, on suppose que vous avez install&eacute; le compilateur et un IDE. La liste commence ici.<br \>
</div><ul><ul><li> SDL_Net.bi                - Install&eacute; avec le compilateur.<br \>
<li> SDL_Net.dll Binary      -http://www.libsdl.org/projects/SDL_net/<br \>
<li> SDL.dll runtime library - http://www.libsdl.org/download-1.2.php <br \>
<br \>
</ul></ul><div class="fb_header">Etape 2: O&ugrave; les placer.</div><br \>
<div class="fb_indent">Le fichier .bi peut &ecirc;tre mis &agrave; peu pr&egrave;s partout o&ugrave; vous voulez le mettre, vous direz au compilateur o&ugrave; le trouver dans la commande <a href="KeyPgInclude.html">'$Include</a>. Les .dll doivent toutefois &ecirc;tre plac&eacute;es dans des endroits sp&eacute;cifiques. La meilleure fa&ccedil;on de s'assurer que le programme sera en mesure d'utiliser ces fichiers est d'avoir la .dll dans le m&ecirc;me dossier que l'ex&eacute;cutable compil&eacute;. Vous pouvez aussi les mettre dans un dossier qui est inscrit dans votre variable d'environnement, mais je ne vousle recommande pas, parce que ce sera plus facile &agrave; trouver et de vous rappeler que vous devez avoir les .dll si vous les mettez dans le m&ecirc;me dossier que l'ex&eacute;cutable, qui devra probablement &ecirc;tre le m&ecirc;me dossier que votre fichier .bas pour le programme principal.<br \>
 <br \>
</div><br \>
Tutoriel en cours ... 
</div>
</div> 
</div> 
</body>
</html>
