<html>
<head>
<title>Unicode</title>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="fb_body_wrapper">
<div id="fb_tab">
<div id="fb_tab_l">Unicode</div>
<div id="fb_tab_r">&nbsp;<img src="images/fblogo_mini.gif" /></div> 
</div> 
<div id="fb_pg_wrapper">
<div id="fb_pg_body">
	Un standard mondial pour le stockage, la cat&eacute;gorisation et l'interpr&eacute;tation des caract&egrave;res<br \>
<br \>
Unicode est un standard industriel con&ccedil;u pour permettre aux textes et aux symboles de tous les syst&egrave;mes d'&eacute;criture du monde d'&ecirc;tre constammment repr&eacute;sent&eacute;s et manipul&eacute;s par des ordinateurs. D&eacute;velopp&eacute;e en tandem avec la norme universelle du caract&egrave;re et publi&eacute;e sous forme de livre comme Le Standard Unicode, Unicode est constitu&eacute; d'un r&eacute;pertoire de caract&egrave;res, une m&eacute;thodologie d'encodage et un ensemble de codages de caract&egrave;res standard, un ensemble de tableaux de codes pour une r&eacute;f&eacute;rence visuelle, une &eacute;num&eacute;ration des propri&eacute;t&eacute;s de caract&egrave;re tels que majuscules et minuscules, un ensemble de fichiers de r&eacute;f&eacute;rence de donn&eacute;es d'ordinateur, et les r&egrave;gles de la normalisation, la d&eacute;composition, la collation et le rendu.<br \>
<br \>
Le Consortium Unicode, l'organisation &agrave; but non-lucratif qui coordonne le d&eacute;veloppement d'Unicode's, a le but ambitieux de remplacer &eacute;ventuellement les sch&eacute;mas d'encodage de caract&egrave;res existants par Unicode et les sch&eacute;mas de son Format de Transformation Unicode (Unicode Transformation Format-->UTF), car beaucoup des sch&eacute;mas existants sont limit&eacute;s en taille et port&eacute;e et sont incompatibles avec les environnements multi-langages. Le succ&egrave;s d'Unicode dans l'unification des jeux de caract&egrave;res a conduit &agrave; son utilisation r&eacute;pandue et pr&eacute;dominante dans l'internationalisation et la localisation des logiciels. Le standrd a &eacute;t&eacute; impl&eacute;ment&eacute; dans de nombreuses technologies r&eacute;centes, incluant le XML, le langage de programmation Java et les syst&egrave;mes d'exploitation modernes.<br \>
<br \>
Les formats Unicode Commun comprennent:<br \>
- <a href="http://fr.wikipedia.org/wiki/UTF-8">UTF-8</a><br \>
- <a href="http://fr.wikipedia.org/wiki/UTF-16">UTF-16</a><br \>
- <a href="http://fr.wikipedia.org/wiki/UTF-32">UTF-32</a>
</div>
</div> 
</div> 
</body>
</html>
